{
    "datas": [
        {
            "title": "Software Engineer - Simulation",
            "location": "Chesterfield, MO",
            "description": "\n\t\t\t\t\tWe are looking to hire Software Engineers with two to ten+ years of experience to work in an agile environment and with applications that simulate aircraft systems, as part of development teams building training devices for military aircraft. Software Engineers build, enhance and optimize applications and programs for the on-going development of aircraft virtual training programs.\nThese positions require a DoD Clearance or the ability to obtain an Interim.\nThe positions are located on-site in St. Louis, MO or Jacksonville, Florida.\nExcellent pay and benefits including 401 company match, medical/vision/dental plans.12 paid holidays, 13 PTO days yearly.\n\nRESPONSIBILITIES:\n· Developing code to incorporate quality inputs in vehicle simulation trainer software Full Software Development Life Cycle (SDLC) environment (defining requirements, designing, implementing and testing the software)\n· SAFe Agile software development\nQUALIFICATIONS:\n· Bachelors of Science degree (computer science, software engineering, computer engineering, or related field)\n· Experience with technologies:\no C, C++, C#, Python, Java\no scripting languages\no GIT\no MS Visual Studio/Visual Studio Code\n· SAFe Agile software development methodology experience desired\n· Windows and Linux/Red Hat experience\n· Software verification experience (i.e. testing/debugging, writing verification cases and procedures, running verification procedures and investigating issues).\nFor more information please call me directly and/or send a resume with a good time to call you.\nJim Jennings - 636-484-6869 - \n\t\t\t\t",
            "postedDate": "February 13, 2022",
            "compName": "CompuScienceIT"
        },
        {
            "title": "Software Engineer Level 0",
            "location": "Fort Meade, MD",
            "description": "\n\t\t\t\t\tAre you ready for change or tired of the red tape? Do you want to work in a limitless environment where you matter, great work is recognized, and have opportunities for advancement? Davis Unlimited Information Technologies, Inc (DUIT) wants you! We have immediate openings for software engineer(s) Level 0. We are looking for the best and brightest software engineers to join our winning and innovative information technology team!\nThe Software Engineer Level 0 develops, maintains, and enhances complex and diverse software systems (e.g., processing-intensive analytics, novel algorithm development, manipulation of extremely large data sets, real-time systems, and business management information systems) based upon documented requirements. Works individually or as part of a team. Reviews and tests software components for adherence to the design requirements and documents test results. Resolves software problem reports. Utilizes software development and software design methodologies appropriate to the development environment. Provides specific input to the software components of system design to include hardware/software trade-offs, software reuse, use of Commercial Off-the-shelf (COTS)/Government Off-the-shelf (GOTS) in place of new development, and requirements analysis and synthesis from system level to individual software components.\n\nAll Applicants must have the following: an active high-level security clearance that required an investigative screening poly exam and meet the job requirements specified for applying position. Currently, we are not seeking clearable applicants. All information provided is subject to verification. A security background check is required, and if you have already completed a background check/clearance, then that is a plus!\nWhy wait? Apply, and submit your resume today!\nQualifications:\n\n· Seven (7) years of experience as a SWE, in programs and contracts of similar scope, type, and complexity is required.\n· A Bachelor’s Degree from an accredited college or university in Computer Science or related discipline. An additional four (4) years of SWE experience on projects with similar software processes may be substituted for a bachelor’s degree.\n· Experience working with the customer or stakeholder to define, document, and implement system requirements.\n· The ability to create and execute test cases for peer code testing.\n\nShall possess the following capabilities:\n\n· Analyze user requirements to derive software design and performance requirements.\n· Debug existing software and correct defects.\n· Provide recommendations for improving documentation and software development process standards.\n· Design and code new software or modify existing software to add new features.\n· Integrate existing software into new or modified systems or operating environments.\n· Develop simple data queries for existing or proposed databases or data repositories.\n· Develop or implement algorithms to meet or exceed system performance and functional standards.\n· Assist with developing and executing test procedures for software components.\n· Write or review software and system documentation.\n· Develop software solutions by analyzing system performance standards, confer with users or system engineers; analyze systems flow, data usage and work processes; and investigate problem areas.\n· Serve as team lead at the level appropriate to the software development process being used on any particular project.\n· Modify existing software to correct errors, to adapt to new hardware, or to improve its performance.\n· Design, develop and modify software systems, using scientific analysis and mathematical models to predict and measure outcome and consequences of design.\n· Design or implement complex database or data repository interfaces/queries\n\nExperience with the following technologies is required or desired:\n\n· Windows OS, Required (2 years)\n· SQL, Required (2 years)\n· Unix/Linux OS, Required (2 years)\n· JAVA or C++, Required (2 years)\n· Groovy on Grails or Similar Technologies, Required (6 months)\n· DoJo Service or Similar Technologies, Required (6 months)\n· HTML, (2 years)\n· CSS, Desired\n· JSP, Desired\n· JavaScript, Required (2 years)\n· AJAX, Desired\n· Spring framework, Desired\n· JEE technologies, Desired\n· Developing Web Services (SOAP and REST), Required (6 months)\n· XML tools (e.g., XPATH, XQUERY, DOM, SAX, XSLT), Desired\n· IIS, Desired\n· APACHE, Desired\n· CASPORT, Desired\n· Public Key Infrastructure (PKI), Required (6 months)\n\t\t\t\t",
            "postedDate": "March 01, 2022",
            "compName": "DUIT"
        },
        {
            "title": "Software Engineer 3 Cloud Analytics",
            "location": "Columbia, MD",
            "description": "\n\t\t\t\t\t10,000 Sign on Bonus for hired candidates who have all skills, clearances, and qualifications Have some qualifications, but not all? Talk tech to us, let's find a solution!\n\nAre you ready for change or tired of the red tape? Do you want to work in a limitless environment where you matter, great work is recognized, and have opportunities for advancement? Davis Unlimited Information Technologies, Inc (DUIT) wants you! We have immediate openings for the best and brightest software engineer(s) with 20 or more years of experience to join our winning and innovative information technology team!\n\nThis position requires a candidate to design, develop, maintain, enhance, and document software systems. Candidate must be able to work independently and/or in a lead technical role, developing system architecture and requirements, defining processes and methodologies, resolving complex technical issues or research problems, and may have responsibility for directing the software activities of a large program.\n\nSecurity Clearance Requirements:\nThis position requires all candidates to be U.S. Citizens and possess an active TS/SCI Security Clearance with Polygraph\n\nResponsibilities:\nDevelops processes to normalize and combine necessary data.\nMines/Analyzes source and pre-processed data.\nProvides software and systems engineering support to a system correlating data from various sources to generate metrics and visualization displays.\nMeets and works with Customers to integrate and enrich data from new sources/flows.\nTwenty (20) years’ experience as a SWE in programs and contracts of similar scope, type, and complexity is required.\nBachelor’s degree in Computer Science, Mathematics, Electrical Engineering, Systems Engineering, Cybersecurity, other Computer Science-related (Software Engineering, Information Systems, Information Technology, Computer Engineering, etc.) from an accredited college or university is required.\n\nEducation & Years of Experience:\no Four (4) years of additional software engineering experience on projects with similar software processes may be substituted for a Bachelor's degree\n\nRequired Skills:\nMust have experience and background in cloud and analytics technology.\nExtensive Linux experience\nWindows knowledge\nPIGLET knowledge\nSplunk (highly desired)\n\nMust have experience with the following:\no Hadoop / Accumulo\n\no JavaScript, Python, PowerShell\n\no C#, Java\n\no PIG\n\no MS SQL Server\n\no MySQL\n\no Windows, Linux\n\no Data Analytics\n\nMust be proactive and have the ability to independently learn.\nNiFi knowledge\nSecurity+, Network+, or A+\nDesired Skills\nNiFi knowledge\nRequired Certifications\nSecurity+, Network+, or A+\n\t\t\t\t",
            "postedDate": "March 01, 2022",
            "compName": "DUIT"
        },
        {
            "title": "Software Engineer 3 Tools and Support",
            "location": "Columbia, MD",
            "description": "\n\t\t\t\t\t10,000 Sign on Bonus for hired candidates who have all skills, clearances, and qualifications Have some qualifications, but not all? Talk tech to us, let's find a solution!\n\nAre you ready for change or tired of the red tape? Do you want to work in a limitless environment where you matter, great work is recognized, and have opportunities for advancement? Davis Unlimited Information Technologies, Inc (DUIT) wants you! We have immediate openings for the best and brightest software engineer(s) with 20 or more years of experience to join our winning and innovative information technology team!\n\nThis position requires a senior level software professional interested in supporting customers with code quality. The ideal candidate possess a wealth of software development expertise and desires to support enterprise customers by guiding and coaching on software development techniques. In addition, this candidate must be willing to support the maintenance and enhancement of tools in support of code quality.\n\nSecurity Clearance Requirements:\nThis position requires all candidates to be U.S. Citizens and possess an active TS/SCI Security Clearance with Polygraph\n\nEducation & Years of Experience:\n\nA minimum of (20) years of software development experience, AND\nA Bachelor's degree in Computer Science or related technical discipline from an accredited college or university\nFour (4) years of additional software engineering experience on projects with similar software processes may be substituted for a bachelors degree\n\nRequired Skills:\nMinimum 5 years AWS development including the security system and network system\nMinimum 3 years of Docker containerization skills\nMinimum of 3 years on at least 2 separate major programming languages (e.g., Java, C#, C++, Python, JavaScript/Typescript)\nMinimum of 2 years testing automation skills, dynamic and static (or related)\n\nRequired Certifications:\nSecurity+, Network+, or A+\n\t\t\t\t",
            "postedDate": "March 01, 2022",
            "compName": "DUIT"
        },
        {
            "title": "FX CashRisk - Software Engineer",
            "location": "Singapore, Central, Singapore",
            "description": "\n\t\t\t\t\tRequisition Number\n246643BR\n\nYour role\n\nAre you passionate about FX Trading Technology? Are you able to use your skills to build robust and scalable multi-server systems? We are looking for someone like that to:\n\n• work as part of a multi-cultural international team to further develop and deploy our FX Static Data System according to business plans and priorities\n• develop first class solutions for Regulatory and Business driven initiatives\n• contribute to the process of translating business and regulatory requirements into innovative solutions\n• work independently on even demanding projects\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou'll be working as a part of an international Foreign Exchange IT team, with team members in Poland, Singapore and Switzerland.\n\nWe develop IT solutions for FX Cash Trading and all its stakeholders that enables our business to grow and ensures it is remaining compliant with the international regulations. Our team focuses on creating sustainable IT solutions to meet the evolving requirements of the business, clients, and the marketplace. We work in close collaboration with the trading desks, the COO team, our control functions, and other IT teams.\n\nYour expertise\n• experience with messaging technologies (IBM MQ), Python or Perl scripting, CORBA middleware\n• experience in designing and implementing multi-threaded systems, development and implementation for low latency and complex real time systems\n• experience in software development in complex distributed real time systems\n• experience with C/C++ on UNIX/Linux\n• experience with shell scripting\n• experience with git and gitlab\n\n*#LI-SG\n\n*EFC-UBS\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\nEmployees working from UBS Singapore offices must comply with Workforce Vaccination Measures as implemented by the Singapore government with effect from 1 January 2022, and other applicable safe management measures as may be amended from time to time.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "z/OS Software Engineer",
            "location": "Zurich, 8037, Switzerland",
            "description": "\n\t\t\t\t\tRequisition Number\n235726BR\n\nYour role\n\nAre you passionate about z/OS Software Engineering? Do you want to help set the direction and strategy for the z/OS operating system? Are you motivated to work in a complex, diverse and global environment? We are looking for an Engineer to join our team and help us to:\n\n• evaluate, plan and integrate technical infrastructure solutions\n• guarantee a secure infrastructure environment as well as production stability and performance\n• analyze errors in systems and define corrective measures (you’ve got a good eye)\n• cooperate with other groups in engineering on delivery of large-scale programs\n• maintain & improve existing deployment and build mechanisms\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nInfrastructure Core is a global organization within Technology Services Infrastructure & Security Engineering, providing technology platforms to underpin our partners business applications. You will be part of the z/OS Systems Engineering team, which has a global footprint and works with other support organizations, Operations staff and wider team members spread across the world. Together we drive consistency across business divisions and optimize operations and support costs, by providing timely, robust, cost effective solutions and products to our clients.\n\nYou'll be working in the z/OS Software Services team based in Basel, Switzerland. As an IT System Engineer, you will be instrumental in setting the direction and strategy for the z/OS operating system across the globe and in designing and building solutions to automate the deployment, configuration and upgrade of these systems. You will be joining a well-established team who will provide invaluable guidance to help you grow your knowledge and career. Teamwork is pivotal to our success; it plays a very important role. We offer flexibility in the workplace and equal opportunities to all our team members.\n\nYour expertise\n• excellent knowledge of z/OS operating systems architecture, design and implementation\n• sound knowledge of SMP/E, software deployment processes, TSO/ISPF, Rexx, z/OS and it's subsystems\n• welcome would be skills in zLinux and Assembler programming, but not necessarily a must-have\n• preferably previous experience working in complex infrastructure projects\n• a committed and visionary team player with analytical and logical mind-set (you can solve problems like nobody’s business)\n• well organized with an innate sense of how to prioritize across a complex environment\n• a hands-on person with natural instincts to support our customers\n• curious, collaborative and constantly interested in learning new things\n• fluent in English and eager to work in an English-Speaking Global Team\n\n*LI-UBS\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nContact Details\nUBS International Recruiting\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Associate Director, IT Software Engineer",
            "location": "Weehawken, NJ",
            "description": "\n\t\t\t\t\tRequisition Number\n248981BR\n\nYour role\n\nUBS Business Solutions US LLC seeks an Associate Director, IT Software Engineer in Weehawken, New Jersey.\n\nWe are looking for someone to:\n• Translate business and IT requirements for new trading venues and datacenter upgrades into technical deliveries.\n• Coordinate the delivery of all Execution and Platform infrastructure components.\n• Oversee the deployment of server hardware.\n• Collaborate with other global IT teams to deliver and maintain the electronic trading infrastructure.\n• Identify bottlenecks on trading systems and tune the server for optimal performance for low latency.\n• Perform performance benchmarks for the trading system to evaluate hardware choices.\n• Fine tune third party stack for performance and low latency on trading systems.\n• Provide third level support to the production services team for investigating system issues and latencies.\n\nQualified Applicants apply through . Please reference 000325 NO CALLS PLEASE. EOE/M/F/D/V\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou'll be working on the Group Technology team located in Weehawken, NJ.\n\nDiversity helps us grow, together. That’s why we are committed to fostering and advancing diversity, equity, and inclusion. It strengthens our business and brings value to our clients.\n\nYour expertise\n• Bachelor’s degree or foreign equivalent in Engineering, Electrical Engineering, Computer Science, Information Technology or related field and seven (7) years of experience in the job offered or as a Systems Engineer, Technical Senior Manager, UNIX Specialist, UNIX Specialist, UNIX Engineer, Senior Customer Support Engineer, UNIX Administrator or related occupation.\n• Position requires experience with the following; managing multiple projects; Linux, Unix OS and server administration; writing scripts (Perl, Unix, Shell or SQL); Network (Switching and Routing); Firewall security; Load Balancing techniques; working with high-volume, low latency real-time messaging applied to electronic trading; server configuration automation; translating business needs into technology solutions; Java Stack messaging technologies, multi-threading and caching; tuning network/server infrastructure for electronic trading; dealing with large amounts of data in real-time applications with big-data technologies; low latency infrastructure cards (SolarFlare and Mellanox); and precision time protocol (PTP).\n\n*LI-DNI\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Senior Software Engineer Java",
            "location": "Pune, Maharashtra, India",
            "description": "\n\t\t\t\t\tRequisition Number\n247365BR\n\nYour role\n\nDo you want to play part in developing a state-of-the-art Front Office Risk System using Cloud Microsoft Azure technologies? Do you have the ability to resolve complex logical issues and think outside of the traditional development box? Do you want to work with a start-up mentality?\nWe are looking for a Java software engineer who can/wants to:\n• Engineer solutions for counterparty credit risk reusing Computation and Data services\n• Create cohesive technology solutions using microservices\n• Take a hands on approach to investigating and solving problems\n• Focus on product quality (utilizing review, testing and fast feedback)\n• Analyze business needs working with business users to inform solution delivery\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou will be working in a hybrid pod comprising Global Treasury Technology, alongside Front Office Risk and P&L teams in Pune, and the Business. The team is highly motivated and consists of data quants and some of the bank's best technologists. This is a hands on technical role, where proven software design and development skills using core java logical approach to problem solving.\n\nYour expertise\nRequired Skills\no Hands on in Core Java which includes but not limited to multithreading, concurrency, memory management, collections\no Experience in Spring, Spring Batch/Boot\no Passionate about Design, Development and best coding practices. OOPS, Design Patterns.\no Good in problem solving, analysis skills (requirement refinement, abstraction), excellent communication skills\no Testing (Unit, System, Integration, UAT, Performance, Stability)\no Test Driven Development / Business Driven Development\no Iterative SDLC (Scrum ideal)\no Experience of large-scale enterprise software\no Results focused with desire to work closely with business partners, as part of a global team\n\nDesirable Skills\no Cloud Experience (AZURE preferred), Kubernetes, Microservices\no Robotic / Cucumber & Gherkin\no Terraform\no One of Big Data, Spark, Scala\no Knowledge of derivatives (FX, Rates, Credit, Commodities, Equities)\no Knowledge of risk\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nContact Details\nUBS Recruiting India\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Software Engineer - Java API Microservices",
            "location": "Krakow, Lesser Poland Voivodeship, Poland",
            "description": "\n\t\t\t\t\tRequisition Number\n242199BR\n\nYour role\n\nDo you want to play a key role in our cloud migration journey? Are you confident managing evolving user requirements? Do you want to design and build best-in-class, scalable applications using the latest technologies?\n\nWe’re looking for an Java Software Engineer to:\n•work in a dynamic, fast-paced environment that provides exposure to reference data and cloud technologies\n• understand business requirement and help define high level design and testing strategies.\n•collaborate to refine user requirements though test-driven development (TDD)\n•communicate effectively with the larger global team and take full ownership of assigned tasks\n•demonstrate strong problem-solving skills and share new concepts\n•perform code reviews and proactively share constructive feedback within the team\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou’ll be working in the Distribution – Data Services Transformation team in Krakow, Poland. We are a dynamic, global team that enjoys working together and we work closely with our clients to understand their requirement and solve their problem. Together as a team, we provide strategic and optimize solution to provision reference data to our users in line with the established Corporate IT Standards. As an API developer, you'll play an important role in migration and adoption of a diverse set of users as part of our cloud migration strategy.\n\nDiversity helps us grow, together. That’s why we are committed to fostering and advancing diversity, equity, and inclusion. It strengthens our business and brings value to our clients.\n\nYour expertise\n•ideally 5+ years of experience as an API Developer with strong programming knowledge in Java (v. 8+)\n•working experience in building REST API and event driven microservices\n•experience in distributed systems and Cloud environment for e.g., Azure (preferred), AWS, GCP\n\nIdeally to have\n•in-depth knowledge of relational and noSQL databases, experience in Cosmos DB is preferred.\n• expert in Spring (Boot, Cloud, Security, Azure), TDD (JUnit, Mockito), BDD (Cucumber, JBehave, Concordion, KarateJS)\n•knowledge of JSR-339 (JAX-RS), JSR-303 (Bean Validation Framework), Swagger or Open API specification, GraphQL is added plus\n•proficient at working with large and complex code bases (GitHub, Gitflow, Fork/Pull Model)\n•experience with continuous delivery and deployment pipelines (Teamcity, Jenkins, Docker, Kubernetes, Helm Charts) and Agile methodologies (SCRUM, XP, Kanban)\n\n*LI-UBS\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nContact Details\nUBS Recruiting Poland\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Software Test Engineer (F/M/D) Hamburg / Germany",
            "location": "Bahrenfeld, 22525, Germany",
            "description": "\n\t\t\t\t\tJob description\n\nOur customer has been the driver of innovations in the field of “secure data” for over 250 years and develops products and solutions for secure identities, secure data and secure infrastructures. The group of companies currently employs a total of more than 3,000 people\n\nSecure identities, secure data and infrastructures are our core competencies for a responsible design of digital change.\n\nWhat do we need for this?\n\nGreat people full of ideas and energy who do their best every day. What you can expect: a wide range of activities and countless opportunities for further development.\n\nShape the digital future with us! We are looking for personalities with team spirit who share our passion for protecting identities and data, think ahead and want to work with us on secure digitization solutions.\n\nTasks\n\nParticipation in the agile DevOps team and ensuring early feedback on the developed functions through consistent automation of tests\nRealization, implementation and documentation of automatic and manual component, integration, system and acceptance tests based on the requirements\nExamination of requirements for their testability, creation of test cases from identified test objects and the development of test scenarios\nSupporting the DevOps team with error analysis (third-level support)\nActive participation in the further development and optimization of the development and test processes\nParticipation in the integration of components to be tested in the test environment\n\nEssential qualifications\n\nSuccessfully completed studies in computer science or a comparable subject, alternatively relevant professional experience in testing software systems\nSound knowledge of web applications and web services, confident handling of relevant test tools such as Selenium,\nProtractor, JMeter and SOAP as well as routine use of methods for test case creation, execution and documentation\nExperience in the integration of Java-based web applications with and without an application server and in dealing with relational databases, CI/CD systems and automatic test systems\nKnowledge of operating platforms such as OpenShift desirable\nCommunication skills paired with the ability to offer constructive criticism\nHigh reliability, independent work and methodical approach as well as fun working in an agile team\n\nDesired language skills\n\nGerman – (B2-C1)\nEnglish – (B2-C1)\n\nLocation:\nHamnurg – Germany\n\nWorking mode:\n\nHybrid\nCompensation & Benefits\n\nSalary range\n€50,000.00 – €70,000.00 annually\n\nHolidays\n30 days\n\nJob benefits\n\nFlexible working hours\nIn-house canteen\nEmployee discounts\nFlat hierarchy\nFitness and health programs\nMeal allowance\nFamily Friendly\nPension or retirement plans\nEducation and career development\nCompany phone\nPossible relocation package\n\t\t\t\t",
            "postedDate": "February 08, 2022",
            "compName": "LEXEM Consulting s.r.o."
        },
        {
            "title": "Sr. Network Engineer",
            "location": "St. Louis, MO",
            "description": "\n\t\t\t\t\tOur Client is a leading technology company serving St. Louis, MO for over 30 years. We are seeking a talented Tier 3 Network Engineer to join our network technologies in our St. Louis, MO location. The primary responsibility is to provide support and management of all toolsets within our “Tech Stack”. The right candidate will show a focus on customer service and customer care, and grow technically within a company that places technical service, customer-first interaction and delivery as its most critical success measure.\nEssential Job Functions/Skills:\n· Project management and project implementation experience\n· Excellent organizational skills and attention to details\n· Deliver solutions based on established practices and procedures\n· Able to work when required with minimal supervision, but willing to additionally work in and contribute to a collaborative team environment\n· Strong consulting skills and ability to develop and clearly present solutions\n· Triage, review, and troubleshoot issues with various IT tools RMM\n· Demonstrated practical knowledge and experience with Microsoft Servers & Desktops\n· Demonstrated practical knowledge in LAN/WAN technologies\n· Extensive experience with creating IT documentation\nTechnical Skills:\n\n· Remote Management Tool: Kaseya or similar\n· Scripting & Automation: Powershell, batch scripting or similar\n· Corporate Anti-Virus Software Management: Crowdstrike, SentinelOne or similar\n· Corporate Backup Management: Unitrends, Datto\n· Corporate Spyware Software Management: Malwarebytes or similar\n· Reporting: Brightgauge, Liongard, Backup Radar, Kaseya\n· Windows Patch Management: Automox, Kaseya\n· Spam Filtering: Barracuda, AppRiver or similar\n· Server Operating Systems: Windows Server 2012, 2016 and 2019\n· Directory Services: Active Directory, Group Policy Management\n· Core Network Services: DNS, DHCP, Remote Desktop Services\n· Networking Technologies: Cisco Meraki devices (firewall, switching, WAPs, etc.) or similar\n· Ticketing Workflow Administration: AutoTask or similar\n· Hypervisors: Hyper-V, VMWare\nEducation & Experience:\n· Bachelor or Associates degree in related field preferred\n· 5+ years network or systems administration experience\n· Previous work experience with a Managed Service Provider is a plus\nBenefits:\nInsurance: Health, vision, dental; PTO; 401k; paid holidays, weekly pay\n\t\t\t\t",
            "postedDate": "February 16, 2022",
            "compName": "CompuScienceIT"
        },
        {
            "title": "SR. Software Engineer (remote)",
            "location": "Denver, CO",
            "description": "\n\t\t\t\t\tOur client is seeking a Senior Software engineer with AREV and OpenInsight 10 programming experience to maintain and advance our current environment. As a Sr. Software engineer, you will be a core member of the data engineering team, building, managing, and monitoring metadata-driven, big data platforms, processing data extracts, and providing transformation products. You will work with a team of passionate, experienced, nimble, and goal-oriented engineers that are solving complex problems to help the company expand.\n\nAmong the responsibilities of the position are :\n\n• Stabilizing and transitioning the legacy Advanced Revelation (AREV) database platform and creating the first product baseline for release to the company's remote offices.\n\n• Working with a development team in customizing software to meet anticipated production requirements.\n\n• Managing DOS AREV, AREV32, AREV64, and OpenInsight (Windows) software programs for DOS/Windows multi-user data access to DebtMaster\n\n• Maintain interfaces with the unique systems, creating data transfer to other company's financial and human resources systems.\n\n• Working with NCB team members as we upgrade from AREV64 to OpenInsight 10.\n\t\t\t\t",
            "postedDate": "February 23, 2022",
            "compName": "Bridgecor"
        },
        {
            "title": "Systems Engineer",
            "location": "Fort Meade, MD",
            "description": "\n\t\t\t\t\tFull-time\n\nAre you tired of the red tape? Do you want to work in a limitless environment where you matter, great work is recognized, and have opportunities for advancement? Change is Now...Davis Unlimited Information Technologies, Inc (DUIT) wants you! We have immediate openings for Systems Engineers. We are looking for the best and brightest Systems Engineers with 7 or more years of experience to join our winning and innovative information technology team! We are currently hiring Systems Engineers including tier I, II, III professionals.\n\nA Systems Engineer at DUIT is responsible for analyzing user requirements, concept of operations documents, and high-level system architectures to develop system requirements specifications. Analyzes system requirements and leads design and development activities. Guides users in formulating requirements, advises alternative approaches, and conducts feasibility studies. Provides technical leadership for the integration of requirements, design, and technology. Incorporates new plans, designs, and systems into ongoing operations. Develops technical documentation. Develops system Architecture and system design documentation.\n\nWhy work for us?\n\no No red tape!\n\no Competitive salaries\n\no Great Health/Dental/Vision Benefits\n\no Excellent 401K plans\n\no Limitless environment where you matter\n\no Recognition of great work and other employee incentives\n\no Opportunities for advancement\n\nDavis Unlimited Information Technologies, Inc. (DUIT) is a woman owned, minority owned small business information technology consulting company. We have opportunities for advancement and our salaries and benefits are competitive. We are an equal opportunity employer; check us out on the web. You can follow us on LinkedIn, Twitter, and Facebook. We do things differently, contact us to find out how...Together, we can DUIT!\n\nWhy wait Apply today!\n\nAll Applicants must have the following: an active high-level security clearance that required an investigative screening exam and meet the minimum job requirements specified for applying position. For this position, we are not seeking clearable or eligible applicants. All information provided is subject to verification. A security background check is required, and if you have already completed a background check/clearance, then that is a plus!\n\nWhat You’ll Get to Do:\n\nManage system requirements and derived requirements to ensure the delivery of production systems that are compatible with the defined system architecture(s) – Department of Defense Architecture Framework (DoDAF), Service-oriented Architecture (SOA), etc.\n\nContribute to the development of sections of systems engineering documentation such as System Engineering Plans, Initial Capabilities Documents, Requirements specifications, and Interface Control Documents\n\nAssist with the development of system requirements, functional requirements, and allocation of the same to individual hardware, software, facility, and personnel components\n\nCoordinate the resolution of action items from Configuration Control Board (CCB) meetings, design reviews, program reviews, and test reviews that require cross-discipline coordination\n\nParticipate in an Integrated Product Team to design new capabilities based upon evaluation of all necessary development and operational considerations\n\nAllocate real-time process budgets and error budgets to systems and subsystem components\n\nGenerate alternative system concepts, physical architectures, and design solutions\n\nDefine the methods, processes, and evaluation criteria by which the systems, subsystems and work products are verified against their requirements in a written plan\n\nDevelop system design solution that satisfies the system requirements and fulfills the functional analysis\n\nQualifications You'll Bring:\n\no Tier I Systems Engineers require- Seven (7) years experience as a SE in programs and contracts of similar scope, type and complexity is required. Bachelor’s degree in System Engineering, Computer Science, Information Systems, Engineering Science, Engineering Management, or related discipline from an accredited college or university is required. Five (5) years of additional SE experience may be substituted for a bachelor’s degree.\n\no Tier II Systems Engineers require- Fourteen (14) years experience as a SE in programs and contracts of similar scope, type and complexity is required. Bachelor’s degree in System Engineering, Computer Science, Information Systems, Engineering Science, Engineering Management, or related discipline from an accredited college or university is required. Five (5) years of additional SE experience may be substituted for a bachelor’s degree.\n\no Tier III Systems Engineers require- Twenty (20) years experience as a SE in programs and contracts of similar scope, type and complexity is required. Demonstrated experience in planning and leading Systems Engineering efforts is required. Bachelor’s degree in System Engineering, Computer Science, Information Systems, Engineering Science, Engineering Management, or related discipline from an accredited college or university is required. Five (5) years of additional SE experience may be substituted for a bachelor’s degree.\n\t\t\t\t",
            "postedDate": "March 01, 2022",
            "compName": "DUIT"
        },
        {
            "title": "Firmware Engineer II",
            "location": "Thorofare, NJ",
            "description": "\n\t\t\t\t\tResponsibilities Include\n\nSpecifying, designing, implementing, releasing, testing and supporting embedded software products for R&D software development department.\nParticipating in embedded design projects from concept to production\nDeveloping utilities, using C/C++, in support of the embedded system development process.\nWriting and executing Engineering / System test plan-cases\n\nQualifications\n\nEducation\n\nBachelors of Science in Electrical Engineering or equivalent field\n\nExperience\n\n2 years experience as an embedded software engineer\n\nKnowledge, Skills & Abilities\n\nTwo (2) years’ experience with C/C++ and embedded real time C\nExperience with bare metal embedded programming Experience with 8 &16 bit Microcontrollers\nExperience developing boot code power on self-test\nKnowledge and experience with In-Circuit Emulators and Logic Analyzers, Schematic Understanding and working closely with Hardware team\nPlus to have Linux/Unix or comparable OS, RTOS experience on 32 bit processor\nExperience with product specifications, systems analysis, microprocessor based systems, and firmware design\nExperience with Microsoft Office applications\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "psoc"
        },
        {
            "title": "Senior Software Testing Engineer",
            "location": "Penha District, Sao Paulo, 03704, Brazil",
            "description": "\n\t\t\t\t\tSenior Test Engineer\n\nWhen your products transform the way we live and work, nothing can be left to chance. Our Test Engineering team takes charge of the testing, evaluation and validation of all our devices. We’re a team of expert engineers responsible for the development of all test cases and test tools to ensure the functionality and compatibility of our products. We’re involved in the whole testing process from preparing test and diagnostic programs to recommending changes in testing equipment procedures and designing new testing equipment.\n\nJoin us as a Senior Test Engineer on our Customer Data team in Brazil to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\nAs a Senior Test Engineer, you will develop and document test plans for newly developed or current hardware and solutions products. You will partner with a test team during test execution and report results to development engineers and leadership. You will also create test plans that include resource requirements based on inputs from Development and Marketing. Finally, you will work with external validation partners to develop comprehensive test plans and test coverage across multiple test organizations.\n\nYou will:\n• Define and implements new test methodologies to reduce test time and increase test coverage\n• Implement a continuous improvement process for test plans, test cases, and automation during and after test projects\n• Evaluate effectiveness of test plan and assess test methodologies to reduce test time and increase test coverage\n• Communicate and partner with test technicians in the execution of test plans\n• Manage use of automation and test tools and identify opportunities for process improvement where possible, and develop and execute test automation scripts\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n• Good understanding of testing concepts/process and hands-on manual testing experience on databases (SQL) and ETL technologies\n• Experience in API Automation any language. ( C# is added advantage ).\n• Familiar with Unit Test, Mock, Test Driven Development etc.\n• Experience in white box, API testing using test tools or test framework\n• Proficient in reading and understanding technical data sheets\n\nDesirable Requirements\n• Bachelor’s degree\n• Knowledge on .NET API\n\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nApplication closing date: 28 Mar 2022\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR166833\n\nRemote/Remotely/Tele/Telecommute/From home\n\t\t\t\t",
            "postedDate": "March 09, 2022",
            "compName": "Dell"
        },
        {
            "title": "Systems Engineer- Aviation-Simulation",
            "location": "Chesterfield, MO",
            "description": "\n\t\t\t\t\tWe are looking to hire multiple Systems Engineers with two or more years of experience to work in a Scaled Agile Framework environment (SAFe) to support all development aspects of engineering solutions that simulate aircraft systems These Engineers will have 2 to 10+ years of experience and be a part of the development teams building training devices for military aircraft. These Systems Engineers will interact with customers, suppliers, program management, integration, and test engineers to help build, enhance, and optimize applications and programs for the ongoing development of aircraft virtual training programs.\nThese positions require a DoD Clearance or the ability to obtain an Interim.\nThe positions are located on-site in St. Louis, MO or Jacksonville, Florida.\nExcellent pay and benefits including 401 company match, medical/vision/dental plans.12 paid holidays, 13 PTO days yearly.\nQualifications include:\n· Ability to interpret and utilize mechanical drawings and electrical schematics to\nvalidate the installation of hardware and system interconnects.\n· Experience in supporting a product through an entire development cycle.\n· Experience with systems engineering tools such as IBM Rational DOORS (Dynamic Object\nOriented Requirements System.\n· Experience working within the Scaled Agile Framework (SAFe) or other Agile development environment.\n· Basic or intermediate experience in software languages (C., C#, C++, Python, Java)\n· Experience with Verification/Validation and Systems Integration\n· Experience with the flight or mission-critical systems and their capabilities typically\nfound in military aviation – including propulsion, navigation, sensor, and weapon suite.\n\nFor more information please call me directly and/or send a resume with a good time to call you.\nJim Jennings - 636-484-6869 - \n\t\t\t\t",
            "postedDate": "February 13, 2022",
            "compName": "CompuScienceIT"
        },
        {
            "title": "Software Test Engineer",
            "location": "Domlur, Karnataka, India",
            "description": "\n\t\t\t\t\tJob Profile: Test Engineer\nWork Location: Bangalore\n\nWhen your products transform the way we live and work, nothing can be left to chance. Our Test Engineering team takes charge of the testing, evaluation and validation of all our devices. We’re a team of expert engineers responsible for the development of all test cases and test tools to ensure the functionality and compatibility of our products. We’re involved in the whole testing process from preparing test and diagnostic programs to recommending changes in testing equipment procedures and designing new testing equipment.\n\nJoin us as a Test Engineer on our Test Engineering team in Bangalore to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\nAs a Test Engineer, you will develop and document test plans for newly developed or current hardware and solutions products. You will partner with a test team during test execution and report results to development engineers and leadership. You will also create test plans that include resource requirements based on inputs from Development and Marketing. Finally, you will work with external validation partners to develop comprehensive test plans and test coverage across multiple test organizations.\nYou will:\n• Assist in collecting test requirements and creating basic test plans and test cases\n• Follow risk management plans and execute test automation scripts\n• Work on assigned test engineering tasks according to project plans including schedule, budget and component cost targets\n• Document text execution progress and issues\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n• 1 to 2 years of relevant experience\n• Basic understanding of hardware and software system architecture and interactions and apply it to resolve issues\n• Enthusiastic about learning new tools, languages and operating systems\n• Proficient in reading and understanding technical data sheets\n\nDesirable Requirements\n• Bachelor’s degree\n\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nApplication closing date: 30-March-2022\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR161735\n\t\t\t\t",
            "postedDate": "March 08, 2022",
            "compName": "Dell"
        },
        {
            "title": "Java Software Engineer in Test FX Trading (IB Technology)",
            "location": "Wroclaw, Lower Silesian Voivodeship, Poland",
            "description": "\n\t\t\t\t\tRequisition Number\n248203BR\n\nYour role\n\nDo you want to play a key role in building FX Trading Applications? Are you proud of delivering quality software to production? Do you like to be challenged and encouraged to learn and grow professionally?\n\nWe are looking for a Java Software Engineer in Test to:\n\n• create automated tests to sign off new functionality\n• take ownership of building, extending and maintaining the test automation suite\n• support the team to adhere to the highest testing standards\n• be involved in the entire software delivery lifecycle\n• support us with our Cloud journey\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou will be working in the FX Orders team in Wroclaw, which is part of a global Investment Bank Technology organization. The team is working using agile principles and is responsible for building and maintaining Client Order Management Systems for FX Resting Orders, applications for FX Price Distribution, and much more. As a Test Automation Engineer, you will play in important role to deliver the best business outcomes by closely collaborating with business stakeholders, product managers and FX Front Office IT.\n\nDiversity helps us grow, together. That’s why we are committed to fostering and advancing diversity, equity, and inclusion. It strengthens our business and brings value to our clients.\n\nYour expertise\n• strong automation development experience with Java\n• good understanding of test automation concepts and patterns\n• confident to work on large projects in complex environments with fast paced deliveries\n• knowledge of test methodologies and the software development lifecycle\n• hands-on experience with Unix and Junit, other technologies are a plus: Spring, Spring Boot, Maven, Mockito, Gradle, Git, JMS, relational databases, Docker\n• FX domain knowledge and cloud technologies are a plus\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nContact Details\nUBS Recruiting Poland\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Cero Design Engineer Experience",
            "location": "Chennai, Tamil Nadu, India",
            "description": "\n\t\t\t\t\tBest Opportunity for Mechanical Design Engineer Experience\nImmediate joiner is preferred.\nTools: Cero Design Engineer\nExperienced with software Knowledge in Solid Work or other design software, Product design and development knowledge, innovative technical details for Mechanical engineers candidate prior Design knowledge is must.\nQualification: Diploma / BE / B Tech Mechanical Engineer\nExperience: Minimum 6 Month or 8 years’ Experience.\nSalary: As per the industry norms.\nFunctional Area: Production / Design Software Skills: Autocad / Solid Works / Creo Work Location: Chennai ( Sriperumbudur / Ambattur )\n\ncall 9176304925\n\t\t\t\t",
            "postedDate": "October 27, 2021",
            "compName": "Red Arrow Pvt ltd"
        },
        {
            "title": "Principal Software Engineer - IT",
            "location": "Austin, TX",
            "description": "\n\t\t\t\t\tIT Principal Software Engineer\n\nThe Software Engineering team delivers next-generation software application enhancements and new products for a changing world. Working at the cutting edge, we design and develop software for platforms, peripherals, applications and diagnostics — all with the most advanced technologies, tools, software engineering methodologies and the collaboration of internal and external partners.\n\nJoin us as a IT Principal Software Engineer on our Software Engineer - IT team in the United States (Remote) to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\nAs an IT Principal Software Engineer, you will deliver products and improvements for a changing world. Working at the cutting edge, you will craft and develop software for platforms, peripherals, applications and diagnostics — all with the most sophisticated technologies, tools, software engineering methodologies and partnerships.\n\nYou will:\n• Develop technical solutions to meet business requirements.\n• Assist in training, work assignment and mentoring of less experienced developers.\n• Provide training and mentor other engineers when required.\n• Be a domain specialist in one or more technical programming specialties.\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n• Ability to apply extensive knowledge of application programming and analysis.\n• Proven experience in software development methodologies.\n• Detailed understanding of key business processes.\n• Ability to communicate and translate needs to technical solutions.\n• Advanced knowledge of automated testing tools and procedures and experience with SQL and NoSQL Databases. MongoDB, Elastic, Solr are big plus.\n\nDesirable Requirements\n\n• 8+ years of validated experience with expertise in the following: Web AP( MS ASP.Net), C#, .Net Framwork, Web Services, WCF, JSON, SOAP, REST, JQuery, Knockout JS, Angular, and .NetCore.\n• Bachelor’s degree in computing engineering or computer science.\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR164215\n\t\t\t\t",
            "postedDate": "March 09, 2022",
            "compName": "Dell"
        },
        {
            "title": "Staff Engineer",
            "location": "Toronto, ON, Canada",
            "description": "\n\t\t\t\t\tAt HelloFresh, we want to change the way people eat forever by offering our customers high quality food and recipes for different meal occasions. Over the past 10 years, we've seen this mission spread around the world and beyond our wildest dreams. Now, we are a global food solutions group and the world's leading meal kit company, active in 16 countries across 3 continents. So, how did we do it? Our weekly boxes full of exciting recipes and fresh ingredients have blossomed into a community of customers looking for delicious, healthy and sustainable options. The HelloFresh Group now includes our core brand, HelloFresh, as well as: GreenChef, EveryPlate, Chef's Plate, Factor, and Youfoodz.\nAbout The Job:\nWe are a close-knit group of engineers of different stripes - developers, testers, and product owners - who are working together to solve interesting e-commerce and supply chain problems around how people eat. Sometimes, this involves executing experiments to improve the user journey and making it easier for our customers to buy amazing food. Sometimes, this means creating stable software solutions that keep our distribution centers running.\nWe are looking for developers who are excited by great code that scales well. As a member of our Toronto team, you’ll work with highly-skilled engineers who have been solving problems in this space for quite some time, and have turned HelloFresh into the #1 meal delivery service in the world!\nHere at HelloFresh, the learning never stops. We expect you to learn every day, both through your work and beyond. We tend to set ambitious learning OKRs for each employee, and then support you through dedicated self-development time and learning budget.\nIf you value speed and agility and believe in a data-driven development space, this is the place for you. The ideal candidate for this role will leverage data - test results, logs, defect rates - to ruthlessly prioritize the work that needs to be done and collaborate with both local and international teams to find MVP solutions.\n\nWhat you’ll do\nTake ownership of the architecture, design, development, deployment and operations of the microservices you will develop, using DevOps practices, pair programming and other cutting edge methodologies\nBe active, solution-oriented member of autonomous, cross-functional agile teams collaborating with Product Owners, Front-end Engineers, Designers, and Business Intelligence teams\nHaving an in-depth understanding of HelloFresh’s core product and architecture, and act as ambassador for software solutions offering support and mentorship to colleagues\nWork with state-of-the-art technologies like Kafka, RabbitMQ, Spark, Kubernetes, Istio, and more\n\nWhat you’ll bring\nSolid back-end experience within Microservice architecture using Golang, Python, or Kotlin\nExperience working with Docker and container orchestration technologies such as Kubernetes\nAs well as experience in CI/CD methods and practices\nPractical experience of TDD, BDD, DDD and distributed architectural patterns\nBackground working with event-driven architectures using RabbitMQ and/or Kafka\nExperienced in end-to-end development processes, including unit, integration & functional testing, distributed architecture, application tuning/profiling, and continuous integration\nExperience working with relational and document databases, including PostgreSQL, MySQL, MongoDB\nYou thrive in the opportunity to collaborate and mentor team members, while also sharing practical knowledge and trends\nInteracting with front-end developers, designers, product managers and our teams around the world is very much part of our day-to-day, so communication skills are vital. We are looking for strong problem-solvers who can apply their engineering skills to a wide range of platforms and environments, while also acting as an ambassador to coach team members and stakeholders.\n\nWhy you'll love it here:\nA competitive salary and company benefits\n75% discount on HelloFresh and Chefs Plate meal kits\nPartial top-up for parental leaves\nA work-from-home allowance and flexibility to work remotely (within Canada) up to four weeks per year - learn more about our flexible Hybrid Work Approach below!\nWe trust and support you - take ownership of your work and push your ideas from inception to execution\nWe want to see you grow - we support your career progression and provide learning and development opportunities\nWe take our work seriously, but we don't take ourselves too seriously. You’ll work with fun, energetic, and supportive teams.\nWe’ve kept up the work-hard, play-hard energy virtually. From team socials to HQ Wellness Wednesdays to holiday and milestone celebrations, you’ll have plenty of opportunity to connect socially with teammates across the company.\n\nHybrid Work Approach\nAt HelloFresh, we know that flexible work arrangements are essential in enabling you to do your best work, while balancing your personal and life needs. Offering remote work flexibility for our employees is a core part of creating a great employee experience. We are also mindful that many employees thrive on in-person interactions and collaboration opportunities at the office (e.g. new joiners, team building, social events, experiencing our product).\nTo meet those needs, we are pleased to provide a Hybrid Work Approach, which enables employees to work from home up to 50% of the time, and also work remotely (within Canada) up to four weeks per year. During the COVID-19 pandemic, our HQ employees are primarily working remotely from home and we have the office open and available on a voluntary basis for employees who wish to work from there. Pending public health guidelines, we expect to return to the office using our Hybrid Work Approach. Employees will receive a minimum of one month’s notice of our Hybrid Work Approach taking effect and when employees will be expected to start work from the office.\n\nWhen we return to the office, you’ll love:\nOur bright and functional space located in the heart of downtown Toronto (110 Spadina Avenue)\nOur test kitchen, where our recipes are tested on-site, so there are delicious meals constantly flowing!\nOur newly renovated employee lounge, decked out with a movie projector, comfy couches, board games, and a ping pong table!\nOur gorgeous rooftop patio, with a perfect view of the CN Tower while you enjoy lunch outdoors!\nOur fully-stocked kitchen with fresh fruit, healthy and not-so-healthy snacks, sparkling water, cold brew coffees, and more. (Are you seeing a pattern yet? Hint: We love food!).\n\nAbout HelloFresh\n\nWe believe that sharing a meal brings people of all identities, backgrounds, and cultures together. We are committed to celebrating all dimensions of diversity in the workplace equally and ensuring that everyone feels a sense of inclusion and belonging. We also aim to extend this commitment to the partners we work with and the communities we serve. We are constantly listening, learning, and evolving to deliver on these principles. We are proud of our collaborative culture. Our diverse employee population enables us to connect with our customers and turn their feedback into meaningful action - from developing new recipes to constantly improving our process of getting dinner to our customers’ homes. Our culture attracts top talent with shared values and forms the foundation for a great place to work!\nAt HelloFresh, we embrace diversity and inclusion. We are an equal opportunity employer and do not discriminate on the basis of an individual's race, national origin, color, gender, gender identity, gender expression, sexual orientation, religion, age, disability, marital status or any other protected characteristic under applicable law, whether actual or perceived. As part of the Company’s commitment to equal employment opportunity, we provide reasonable accommodations, up to the point of undue hardship, to candidates at any stage, including to individuals with disabilities.\n\t\t\t\t",
            "postedDate": "February 28, 2022",
            "compName": "Hellofresh"
        },
        {
            "title": "Software Senior Engineer",
            "location": "Domlur, Karnataka, India",
            "description": "\n\t\t\t\t\tSoftware Senior Engineer-Backend Java Developer\n\nThe Software Engineering team delivers next-generation application enhancements and new products for a changing world. Working at the cutting edge, we design and develop software for platforms, peripherals, applications and diagnostics — all with the most advanced technologies, tools, software engineering methodologies and the collaboration of internal and external partners.\n\nJoin us as a Senior Software Engineer – Java Backend developer on our AR engineering development team in Bangalore, India to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\n\nAs a Senior Software Engineer, you will be mainly responsible for developing java microservices in sprint boot, working with other technologists to build software solutions for AR engineering team modern applications.\n\nYou will:\nContribute to the design and architecture of new or re-engineered microservice components as per business needs\nPrepare written software/ specifications for sophisticated products from architectural diagrams and documents\nBuild and review design, functional, technical and/or user documentation, as needed\nDevelop, review and implement test strategies for software products and systems\n\nTake the first step towards your dream career\n\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements:\nExperience - 5 - 7 Years\nExperience in Java backend.\nExperience in Data structures and Algorithms.\nExperience in Spring Boot and Microservices.\nExperience with XML & JSON, experience in Messaging formats like RabbitMQ and Kafka\n\nDesirable Requirements:\nKnowledge of basic UI development will help in integrating the services with UI, HTML/CSS pages and our future readiness of moving towards full stack developer transformation.\nKno.wledge of Oracle EBS AR functionality.\nPCF /PKS (Kubernetes) - Added Advantage.\n\nHere’s our story; now tell us yours\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nApplication Closing Date: Feb 2022\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Employment Opportunity Policy here.\n\nFull time\n\nR160959\n\t\t\t\t",
            "postedDate": "March 08, 2022",
            "compName": "Dell"
        },
        {
            "title": "DotNet Software Engineer",
            "location": "Bucharest, 010200, Romania",
            "description": "\n\t\t\t\t\tBe a part of a team that’s ensuring Dell Technologies' product integrity and customer satisfaction.\n\nOur IT Software Engineer team turns business requirements into technology solutions by designing, coding and testing/debugging applications, as well as documenting procedures for use and constantly seeking quality improvements.\n\nJoin us as .NET Software Engineer on our Dell Digital Information Technology team to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\n\nAs a .NET Software Engineer, you will deliver products and improvements for a changing world. Working at the cutting edge, you will develop software for the Treasury department — all with the most sophisticated technologies, tools, software engineering methodologies and partnerships.\nYou will:\nCollaborate with Product Managers, Designers and other Engineers to design and implement state of-the-art cloud-native products using .NET Core and Angular\nEngage across the organization to develop integrated and differentiated solutions\nImplement solutions using TDD processes integrating Unit, Integrated and Automated UI Testing to CI/CD pipeline\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\nExperience implementing .NET web applications, micro services and API's\nGood knowledge in .NET Core, microservices and modern cloud-based architectures\nExperience implementing solutions with Angular, Git source code control system and Continuous Integration (CI)/Continuous Delivery (CD) pipelines\nExperience maintaining automated tests\n\nDesirable Requirements\nExperience with Agile/Lean principles and processes\nExperience with Behavior Driven Development (BDD) and Acceptance Test Driven Development (ATDD) using SpecFlow, Selenium and SauceLabs\n\nFull time\n\nR168763\n\t\t\t\t",
            "postedDate": "March 09, 2022",
            "compName": "Dell"
        },
        {
            "title": "Software Senior Engineer",
            "location": "San'ai, Taipei, 100, Taiwan",
            "description": "\n\t\t\t\t\tDell is looking for software developers to work on software solutions in the personal computing and cloud domains for our Taiwan Software Development Center. In this role, you will be responsible for working closely with other technologists, architects, experience designers, product marketers, software developers and validation engineers to create software solutions for Dell’s products that encompass middleware components, applications, user interfaces and cloud software layers.\n\nJoin us as a Software Senior Engineer on our Software Engineering team in Taipei to do the best work of your career and make a profound social impact.\n\nResponsibilities include:\n\nDevelop next generations products and will have an opportunity to shape the best in the world client technologies.\n\nTake ideas from concept phase through delivery, including creating high level design documents, scoping design and requirements and detailed specification creation\n\nDevelop Proof of concept designs and implement them as product features with specific focus on device instrumentation, diagnostics and serviceability of client platforms\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\nEssential Requirements\n\nStrong knowledge of Computer Architecture\n\nStrong knowledge of C#, C/C++ programming languages\n\nExperience in feature requirements, architecture and design of applications which interact closely with hardware devices and operating system core, IPC on for Windows operating systems on different CPU architectures (x64, arm64 etc.)\n\nExperience with Agile SW development practices\n\nKnowledge of BIOS, Firmware, Hardware interfaces, Device Drivers, WMI\n\nHere’s our story; now tell us yours\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nApplication closing date: 31 March, 2022\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Employment Opportunity Policy here.\n\nFull time\n\nR148419\n\t\t\t\t",
            "postedDate": "March 10, 2022",
            "compName": "Dell"
        },
        {
            "title": "Software Engineer 2",
            "location": "Shivajinagar, Maharashtra, India",
            "description": "\n\t\t\t\t\tJob Title: Software Engineer 2 (Full-Stack)\nLocation: Pune\n\nJoin us as a Software Engineer 2 on our Live Optics team in Pune to do the best work of your career and make a profound social impact.\n\nDell EMC Live Optics™ is the next generation of IT workload profiling created to allow a modern method of collecting, visualizing, and sharing performance and design characteristics for IT environments. Currently Live Optics is utilized in 170 countries by IT Professionals as well as employees and partners of the entire Dell Technologies family of companies.\n\nThe Dell EMC Live Optics team is expanding in Pune. Each member of Live Optics is expected and encouraged to express their creativity for problem solving and contribute to both technique and features of the product. A true opportunity for your ideas to come alive and be globally utilized is at your fingertips. Do you have a passion to work with cutting edge cloud technologies? Do you have a desire to influence evolving cloud initiatives? The Live Optics team is looking for an exceptional, highly motivated and ambitious team player to build, execute and deliver a best of breed software stack to our customers.\n\nKey Responsibilities\nAs a Software Engineer 2, you will take technical ownership of high-level feature requests, and coordinate with the US, Irish, and Egyptian engineering teams. You will implement features, often spanning multiple components within the backend infrastructure. Core responsibilities include:\n\nDemonstrates skills & ownership in technical and team capacities.\n\nCoding solutions to a high level of testability, modularity and maintainability\n\nAnalyzes, estimates, reviews and software specifications for business requirements\n\nOperates with agility and adapts to technologies and processes quickly\n\nThe ability to thrive in a collaborative Agile environment\n\nPair programming with senior engineers.\n\nEssential Requirements\n\n4+ years experience in designing, developing and scaling software applications\n\nExperience in any front-end framework like Angular/React/Node preferably React & TypeScript\n\nExperience in C#, .NET stack & Client-server API\n\nRelational database development experience\n\nAbility to operate across an end-to-end tech stack, frontend through to backend\n\nExcellent verbal and written communication skills\n\nDesirable Requirements (optional)\n\nKnowledge around storage, server & network domain.\n\nExposure to any cloud infrastructure like Azure/AWS/GCP\n\nHere’s our story; now tell us yours\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nApplication closing date:\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Employment Opportunity Policy here.\n\"#NJP\"\n\nFull time\n\nR170155\n\t\t\t\t",
            "postedDate": "March 09, 2022",
            "compName": "Dell"
        },
        {
            "title": "Senior Software Engineer - IT",
            "location": "Round Rock, TX",
            "description": "\n\t\t\t\t\tIT Senior Software Engineer\n\nBe a part of a team that’s ensuring Dell Technologies' product integrity and customer satisfaction. Our IT Software Engineer team turns business requirements into technology solutions by designing, coding and testing/debugging applications, as well as documenting procedures for use and constantly seeking quality improvements.\n\nJoin us as a Senior Software Engineer on our Information Technology team in Round Rock (Remote) to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\nAs an IT Senior Software Engineer, you will deliver products and improvements for a changing world. Working at the cutting edge, you will craft and develop software for platforms, peripherals, applications and diagnostics — all with the most sophisticated technologies, tools, software engineering methodologies and partnerships.\nYou will:\n• Design specifications for high availability and highly scalable applications which will be used by both internal and external customers\n• Work with clients and business analysts to settle software requirements and system impacts\n• Manage projects with small to moderate budgets; may perform in project leadership role and/or supervise the activities of lower-level personnel\n• Conduct and supervise production launches and post-launch support, coordinating with geographically distributed teams in conference calls\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n• Broad knowledge of application programming and procedures to tackle complex problems\n• Strong understanding of intersystem dependency around primary applications and multiple secondary applications\n• Sophisticated diagnostic and problem-solving skills\n• Excellent team player, yet capable of managing multiple solo projects at once\n• Ability to quickly adapt to new information and develop comprehensive knowledge of systems being tested\n\nDesirable Requirements\n• Bachelor’s degree or equivalent\n• 5 to 8 years of validated experience in testing/coding/IT software\n\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR159264\n\t\t\t\t",
            "postedDate": "March 10, 2022",
            "compName": "Dell"
        },
        {
            "title": "Senior Software Engineer",
            "location": "Domlur, Karnataka, India",
            "description": "\n\t\t\t\t\tSenior Software Engineer - Oracle EBS Technical Consultant\n\nThe Software Engineering team delivers next-generation application enhancements and new products for a changing world. Working at the cutting edge, we design and develop software for platforms, peripherals, applications and diagnostics — all with the most advanced technologies, tools, software engineering methodologies and the collaboration of internal and external partners.\n\nJoin us as a Senior Software Engineer – Oracle EBS Consultant developer on our AR engineering development team in Bangalore, India to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\n\nAs a Senior Software Engineer, you will be mainly responsible for developing Oracle PLSQL components, working with other technologists to build software solutions for AR engineering team modern applications.\n\nYou will:\nContribute to the design and architecture of new or re-engineered PLSQL components as per business needs\nPrepare written software/ specifications for sophisticated products from architectural diagrams and documents\nBuild and review design, functional, technical and/or user documentation, as needed\nDevelop, review and implement test strategies for software products and systems\n\nTake the first step towards your dream career\n\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements:\nOracle Apps Technical consultant with 6+ years of experience\nStrong in developing PL/SQL Packages, Procedures, Functions.\nGood in advanced concept of PL/SQL and Finance Modules (AR - Mandatory) Experience.Should be good on Conversions and Interfaces.\nShould have Table level knowledge of Oracle Financials.Strong Knowledge in Oracle Workflow Builder.\nExperience in creating custom workflow.Experience in developing RICE objects Reports, Interfaces, Conversions, Extensions independently.Good knowledge in customization/development of forms.\n\nDesirable Requirements\nKnowledge of Java Technologies\nPCF /PKS (Kubernetes) - Added Advantage.\n\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nApplication Closing Date: Feb 2022\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Employment Opportunity Policy here.\n\nFull time\n\nR160964\n\t\t\t\t",
            "postedDate": "March 08, 2022",
            "compName": "Dell"
        },
        {
            "title": "Senior Software Engineer - IT",
            "location": "Bucharest, 010200, Romania",
            "description": "\n\t\t\t\t\tSenior Software Engineer\n\nDell IT is part of Dell Technologies. It creates technology solutions for a changing world. Our Information Technology (IT) Architecture team translates our customers’ business requirements into total enterprise-wide solutions. It takes deep technical knowledge to create architectural designs that exceed service requirements. We’re skilled in analyzing the customer’s business goals, objectives, needs and general business environment to create technical system solutions. Our expertise includes integrating hardware, processes, methodologies and software into the customer environment.\n\nAbout our Business Unit:\n\nDell Services offers various custom services. These services, ranging from custom box labels to specific hardware and BIOS settings, give customers additional flexibility when building their computer systems. As an example, Imaging Services - it allows customers to specify a desired operating system, software applications, and system settings; in other words, the image that is burned onto the computer’s hard drive when it is built in the factory. Likewise - Asset Services, Asset Reporting, Hardware, Custom BIOS settings etc.\n\nWe are looking for a Software Engineers who will be part of Dell Services IT engineering team and will be responsible for delivering programs in a dynamic, fast paced, scalable agile environment that fulfills Dell Services customer requirements.\n\nThe individual would be part of Dell Services IT engineering team and should possess excellent technical design skills, development & deployment expertise. Should be highly motivated, goal-oriented, and passionate about customer experience and satisfaction. As part of the team, the individual will be responsible for new development, innovation, implementing and deploying new enhancements to Dell Services custom apps and platforms, interacting with development teams globally, work closely with our business partners to understand requirements, and high quality deliverables in a timely manner.\n\nResponsibilities:\nLooking for someone who is passionate about coding and should be a hardcore developer.\nThis is a pure development role and we are looking for someone who can invest time in learning new technologies and come with innovative solutions.\nWorks with clients and Business Analysts to determine software requirements and system impacts.\nGenerates technical documentation as well as unit and functional tests.\nMentors junior developers in industry best practices, procedures, and concepts.\nIs responsible for ensuring quality of their work as well as the work of the entire development team.\nWorks closely with the global development team, other senior Solution Architects to plan ongoing feature development, product maintenance, and management of development teams.\n\nRequirements:\nEngineering Degree in Computer Science/Engineering, or equivalent professional experience.\nAt least 4+ years experience in building web portals and/or ecommerce applications using Microsoft technologies.\nExpertise in most of the following UI tools Angular and React.\nGood to have most of the following –Web API (MS ASP.Net), MVC, WCF, HTML5, CSS, JavaScript, JSON, SOAP, REST, JQuery, .Net Framework, C#, Web Services.\nGood to have knowledge of object-oriented programming.\nGood to have SQL Server, Pl/Sql development and database design.\nShould have worked with Unit Test, Mock, Test Driven Development etc.\nHave knowledge of different branching strategies and DevOps.\nKnowledge of Cloud and Containers is an added advantage.\nInitiates major changes in architecture and software development techniques/processes.\nAnalyzing business requirements, processes, data, and system integration points to determine/recommend appropriate technology solutions.\nDesigning, coding, testing, documenting, and deploying global applications based on system and user requirements.\nAnalyze and resolve performance issues in all environments.\nExpert knowledge in analyzing, designing, and developing solutions to highly complex problems.\nStrong communication skills, including the ability to convey technical information effectively to both IT and business audiences.\nKnowledge of Agile methodology.\n\nFull time\n\nR170235\n\t\t\t\t",
            "postedDate": "March 10, 2022",
            "compName": "Dell"
        },
        {
            "title": "Software Engineer - Remote",
            "location": "Seattle, WA",
            "description": "\n\t\t\t\t\tSoftware Engineer\n\nJoin us as a Software Engineer on our team based in Seattle (but you can work remote from anywhere in the contiguous US states) to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\nAs a Software Engineer, you will be working at the cutting edge, developing solutions protecting data everywhere from modern software-defined data centers to workloads running in hyperscale hybrid and public cloud environments.\n\nDell provides the technology that transforms the way we all work and live. But we are more than a technology company. We are a people company. We inspire, challenge, and respect every one of our over 150,000 employees. We also provide them with unparalleled growth and development opportunities.\n\nWhat you’ll achieve\nAs a Software Engineer, you will help deliver on the next generation of automation and tools for the NAS suite of products.\n\nYou will\nImplement automation solutions to enable test workflows in multi-cloud and on-prem environments.\nFocus on increasing the quality of code by reviewing, providing feedback, and improving solutions.\nParticipate in continuous improvement initiatives, develop new software engineering processes, re-evaluate existing processes.\n\nTake the first step towards your dream career\n\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\nDegree in Computer Science or related field\nExperience in Python\nFamiliar with Distributed Systems concepts and design\nStrong Software Engineering fundamentals\nExperience with cross-team collaboration\n\nDesirable Requirements\nBachelor’s degree\nUnderstanding of software engineering processes and methodologies\nExcellent communication and interpersonal skills\n\nHere’s our story; now tell us yours\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR168964\n\t\t\t\t",
            "postedDate": "March 10, 2022",
            "compName": "Dell"
        },
        {
            "title": "Systems Engineer 5 Windows Administrator",
            "location": "Columbia, MD",
            "description": "\n\t\t\t\t\t10,000 Sign on Bonus for hired candidates who have all skills, clearances, and qualifications Have some qualifications, but not all? Talk tech to us, let's find a solution!\n\nAre you ready for change or tired of the red tape? Do you want to work in a limitless environment where you matter, great work is recognized, and have opportunities for advancement? Davis Unlimited Information Technologies, Inc (DUIT) wants you! We have immediate openings for the best and brightest software engineer(s) with 20 or more years of experience to join our winning and innovative information technology team!\n\nWindows Systems Administrator / Systems Engineer Level 5\n\nThe Windows Systems Administrator maintains smooth operation of multi-user computer systems, including coordination with network administrators. Duties may include setting up administrator and service accounts, maintaining system documentation, tuning system performance, installing system wide software and allocate mass storage space. Interacts with users and develops and monitors policies and standards for allocation related to the use of computing resources.\n\nSecurity Clearance Requirements:\n\nThis position requires all candidates to be U.S. Citizens and possess an active TS/SCI Security Clearance with a Polygraph\n\nQualifications\n\nA High School Diploma or GED plus nineteen (19) years of relevant Windows Systems Administration experience OR\nA Bachelor's degree in a technical discipline from an accredited college or university AND a minimum of fifteen (15) years of relevant Windows Systems Administration experience\n\nOR\n\nA Master's degree in a technical discipline from an accredited college or university AND a minimum of thirteen (13) years of relevant Windows Systems Administration experience\n\nRequired Skills\n\nTier II/III ticket support\nAccreditation and authentication/Security experience\nExcellent customer service skills\nExcellent problem-solving abilities\nAbility to work across a broad range of projects Required Certifications\nSecurity+, Network+, or A+\n\t\t\t\t",
            "postedDate": "March 01, 2022",
            "compName": "DUIT"
        },
        {
            "title": "Tech Engineer",
            "location": "Pune, Maharashtra, India",
            "description": "\n\t\t\t\t\tRequisition Number\n247999BR\n\nYour role\n\nWe are looking for a passionate and experienced hands-on Software Engineer with sound and established cloud knowledge, hands on Microsoft Power Automate(Flow) and Power Apps experience to manage and build business applications / solutions/ data platform to empower UBS and deliver increased profitability or capacity optimization. Would you like to apply your skills and knowledge in an exciting lean startup organization consisting of multi-disciplinary experts from technology engineering and COO business?\n\nYou will be expected to:\n\n• be part of a scrum team working on delivering business value through software\n• design and develop business applications and solutions using Power Automate (Flow) and Power Apps\n• implement and deliver high quality software leveraging the latest cloud based technologies\n• drive forward design and front-to-back implementation and integration of various software components with creation of re-usable overall solutions deployed broadly across UBS environments, focused on both dynamic & frictionless user interfaces, reporting and automation\n• conduct code review and test software as needed\n• take ownership and provide technical direction and system architecture\n• work on technical improvements to achieve time and material benefits\n• possess a high level of curiosity and awareness of emerging technologies and trends\n• work closely with the team (product owner, data scientists, engineers, UX/UI designers) and front-to-back business & technology partners to understand the underlying business problem, coordinate requirements and transform them into system requirements and application design\n• adhere to operational controls and procedures to promote software from test to production\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou will be working in the CDIO IB Technology team in partnership with the IB COO function to transform the way we run the business by building business applications, solutions & workflows to empower UBS and deliver increased productivity & profitability. You will work alongside other experts on a genuinely ground breaking project with the latest cloud based data technologies and you will contribute to solution and application delivery in the project. Your team will be part of IB COO group, putting you at the forefront of delivering on our innovation agenda. The team is being run with a particular emphasis on Dev Ops and the CI/CD pipeline and located globally across London and Poland.\n\nYour expertise\n• high level of curiosity and awareness of emerging technologies, particularly in cloud, data pipelines, machine learning,\n• experienced developer in at least two of the following languages Java, Scala or Python\n• hands on working experience on developing business applications and solutions using Power Automate (Flow) and Power Apps.\n• experienced in designing Applications/Workflows\n• power BI knowledge and hands on will be an added advantage\n• hands on experience working with Agile development methodologies\n• experience with RDBMS such as SQL Server, PostgreSQL or MySQL\n• experience of cloud, ideally Azure\n• deep understanding and hands-on experience of Agile, DevOps and engineering practices using micro-services, DDD, CI/CD pipeline and test automation\n• infrastructure as Code (IaC) using tools such as Terraform or Azure Resource Manager\n• mentor junior team members and share knowledge of your skillsets out to the wider team\n\n#LI-SS1\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nContact Details\nUBS Recruiting India\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Data Engineer",
            "location": "Wroclaw, Lower Silesian Voivodeship, Poland",
            "description": "\n\t\t\t\t\tRequisition Number\n247214BR\n\nYour role\n\nAre you a skilled Data Engineer who pays attention to details and is quality driven? Are you keen on learning and utilizing latest frameworks and technologies on daily basis? We are looking for someone who would like to:\n\n•First and foremost contribute to the development of our products and guide the future evolution of our systems\n•Apply best development practices\n•Master and utilize state-of-the-art technologies within our products\n•Design for today's requirements but at the same time keep in mind future evolution of the systems\n•Be part of UBS Software Labs communities which give you an opportunity to develop your skills as well as share your knowledge and experiences with others\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nWe are a team of open minded and highly motivated professionals who care about quality. We are accountable for what we do and have a full say in how we do things. It is not only we do believe in Agile, XP practice – we embody all of those in our everyday work to ensure our software has the highest quality and \"value to customer\" at its heart. You will be cooperating with the teams located in Wroclaw as well as working across\nWealth Management Americas on a strategic clients supervisory application in UBS.\n\nYour expertise\nYou have:\n•+ 1 year of experience on a similar position\n•Experience in Python programming\n•Experience with RDBMS such as Oracle, PostgreSQL\n•Understanding and experience in CI/CD approaches\n•Knowledge of Agile development practices (Scrum, Kanban etc.)\n\nNice to have:\n•Experience in building of data pipelines using Spark and Hadoop\n•Experience in Cloud technologies, especially Azure\n•Knowledge of additional languages like Java or Scala\n•Infrastructure as Code (IaC) using tools like Terraform and ARM templates\n\n*LI-UBS\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, at UBS we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves.\n\nReady to be part of #teamUBS and make an impact?\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": ".NET Software Engineer",
            "location": "Brasilia, Federal District, Brazil",
            "description": "\n\t\t\t\t\t.NET/React Software Engineer (Brasil - Remoto)\n\nFaça parte de uma equipe que garante a integridade do produto da Dell Technologies e a satisfação do cliente. Nossa equipe de .NET/React Software Engineer transforma requisitos de negócios em soluções de tecnologia, projetando, codificando e testando / depurando aplicativos, bem como documentando procedimentos para uso e buscando constantemente melhorias de qualidade.\n\nJunte-se a nós como .NET/React Software Engineer em nossa organizaçãoDell Financial Services Information Technology no Brasil (Remote) para fazer o melhor trabalho de sua carreira e causar um profundo impacto social.\n\nO que você atingirá\nComo engenheiro de software de TI, você fornecerá produtos e melhorias para um mundo em mudança. Trabalhando com tecnologia de ponta, você criará e desenvolverá software para plataformas, periféricos, aplicativos e diagnósticos - tudo com as mais sofisticadas tecnologias, ferramentas, metodologias de engenharia de software e parcerias. Nesta função, você trabalhará em uma solução de gerenciamento de crédito do cliente responsável por todo o volume de transações do Dell Financial Services globalmente. Como um Full Stack Software Engineer em nossa equipe global, você dará suporte às soluções de back-end e front-end necessárias para dar suporte a esse trabalho central.\n\nVocê irá:\n\nTrabalhar com aplicativos de negócios complicados em áreas funcionais\n\nLevar o design do conceito à produção, que pode incluir análises de design, implementação de recursos, teste, resolução de problemas e suporte de fábrica\n\nGerenciar revisões de design e código com foco na melhor experiência do usuário, desempenho, escalabilidade e expansão futura Interaja com uma equipe global e divertida, trocando experiências e colaborando no suporte ao crescimento do negócio\n\nDê o primeiro passo em direção à carreira dos seus sonhos\nCada membro da equipe Dell Technologies traz algo único para a mesa. Aqui está o que procuramos com esta função:\n\nRequisitos essenciais\n\nInglês avançado\n\nExperiência com .Net Core e React (ou qualquer estrutura / padrão de IU) e suas ferramentas relacionadas e práticas recomendadas de codificação\n\nExperiência trabalhando com arquitetura de microsserviços, APIs REST, bibliotecas ou utilidades, bem como com Gitlab como repositório de código\n\nRequisitos Desejáveis\n\nCapacidade de encontrar um consenso rápido de novas informações e conhecimento moderado do sistema que está sendo testado\n\nExperiência com infraestrutura em nuvem: uma plataforma PaaS ou IaaS, como AWS, GCP, Azure ou PCF\n\nExperiência com banco de dados, como Oracle e / ou SQL Server\n\nExperiência em escrever testes, incluindo testes unitários e de integração\n\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nApplication closing date: 07 Março 2022\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n.NET/React Software Engineer (Brazil - Remote)\n\nBe a part of a team that’s ensuring Dell Technologies' product integrity and customer satisfaction. Our IT Software Engineer team turns business requirements into technology solutions by designing, coding and testing/debugging applications, as well as documenting procedures for use and constantly seeking quality improvements.\n\nJoin us as a .NET/React Software Engineer on our Dell Financial Services Information Technology organization in Brazil - Remote to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\n\nAs an IT Software Engineer, you will deliver products and improvements for a changing world. Working at the cutting edge, you will craft and develop software for platforms, peripherals, applications and diagnostics — all with the most sophisticated technologies, tools, software engineering methodologies and partnerships.\nIn this role you will work on a customer credit management solution responsible for the entire Dell Financial Services transaction volume globally. As a full stack engineer in our global team, you will support both back end and front-end solutions needed to support this core work.\n\nYou will:\n\nWork with complicated business applications across functional areas\n\nTake design from concept to production, which may include design reviews, feature implementation, debugging, testing, issue resolution and factory support\n\nManage design and code reviews with a focus on the best user experience, performance, scalability and future expansion\n\nInteract with a global and fun team, exchanging experiences and collaborating in support to business growth\n\nTake the first step towards your dream career\n\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n\nAdvanced level of English\n\nExperience with .Net Core and React (or any UI framework/pattern), and its related tools and coding best practices\n\nComfort working with Microservices architecture, REST APIs, libraries or utilities, as well as with Gitlab as a code repository\n\nDesirable Requirements\n\nExperience with cloud infrastructure: one PaaS or IaaS platform such as AWS, GCP, Azure or PCF\n\nExperience with Data base, such as Oracle and/or SQL Server\n\nExperience with writing tests, including unit and integration tests\n\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nApplication closing date: 07 March 2022\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR129605\n\nRemote/Remotely/Tele/Telecommute/From home\n\t\t\t\t",
            "postedDate": "March 07, 2022",
            "compName": "Dell"
        },
        {
            "title": "Senior Principal Software Engineer - IT",
            "location": "Austin, TX",
            "description": "\n\t\t\t\t\tSenior Principal Software Engineer\n\nBe a part of a team that’s ensuring Dell Technologies' product integrity and customer satisfaction. Our IT Software Engineer team turns business requirements into technology solutions by designing, coding and testing/debugging applications, as well as documenting procedures for use and constantly seeking quality improvements.\n\nJoin us as a Senior Principal Software Engineer on our Information Technology team in United States (Remote) to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\nAs a Senior Principal Software Engineer, you will deliver products and improvements for a changing world. Working at the cutting edge, you will craft and develop software for platforms, peripherals, applications and diagnostics — all with the most sophisticated technologies, tools, software engineering methodologies and partnerships.\n\nYou will:\n• Lead changes in architecture, methodology or programming procedures.\n• Assist in crafting the strategic technical and architectural direction to the programming function.\n• Act as prime consultant on large projects that affect the organizations long-term goals and objectives.\n• Acquire detailed specification from business users and development to ascertain specific output.\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n13+ years of software development experience.\nExpertise in most of the following – Web API (MS ASP.Net), C#, .Net Framework, Web Services, WCF, JSON, SOAP, REST, JQuery, Knockout JS, Angular.\nExperience in building micro services and cloud native applications. Experience with AWS or Azure or PCF.\nProven track record demonstrating ability to achieve stretch goals in a highly innovative and fast paced environment.\nExpertise in engineering / administration with ElasticSearch.\n\nDesirable Requirements\nQuick learner with motivation to learn new languages, technologies and frameworks (you will get opportunity to play with a lot of new technologies).\nPerformance improvements / tuning of applications.\n\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR165011\n\t\t\t\t",
            "postedDate": "March 09, 2022",
            "compName": "Dell"
        },
        {
            "title": "Engineer Project",
            "location": "Houston, TX",
            "description": "\n\t\t\t\t\tAre you an experienced, passionate pioneer in technology? A cloud solutions builder who wants to work in a collaborative environment. As an experienced AWS Java Full Stack Developer, you will have the ability to share new ideas and collaborate on projects as a consultant without the extensive demands of travel. If so, consider an opportunity with Deloitte under our Project Delivery Talent Model. Project Delivery Model (PDM) is a talent model that is tailored specifically for long-term, onsite client service delivery. PDM practitioners are local to project locations, minimizing extensive travel, and provides you with a full career path within the firm.\n\nWork you’ll do/Responsibilities\n\n• As Java/AWS Full Stack Engineer, you will develop modern web-based applications for AWS, including program design, coding, testing, debugging, and requirements documentation at a mastery level.\n• You will ensure application design, development schedule, and implementation while meeting, or exceeding documented application scope/timeline, and adhering to established standards.\n• You will Design, Code, Unit Test Java based Web applications for AWS using angular, Java, Micro-Services, and spring frameworks\n• You will work with both on-site and offshore team to ensure smooth delivery\n• You will work with Business stakeholders to understand business requirements and document them\n• You will drive analysis of required functionality and implements customizations to platforms or develops custom solutions to fulfill business requirements with a mastery focus on technical excellence and high quality\n• You will perform technical design and maintain documents technical specifications. Assists application architects in the creation of application, integration, and data architecture. Develops /teaches team members of these skills\n• You will work with Product Owners to drive product vision, manage scope and client expectations\n• You will design reliable, scalable, and performant end-to-end architectures – functional, data, technology, infrastructure\n\nThe Team\n\nCore Technology Operations supports our clients as they improve agility, resilience and identifies opportunities to reduce IT operations spend through automation. We accelerate our clients toward a technology-driven future, leveraging vendor solutions, Deloitte-developed software products, tools, and accelerators.\n\nQualifications Required\n\n• Bachelor's degree, preferably in Computer Science, Information Technology, Computer Engineering, or related IT discipline; or equivalent experience\n• 12+ Years of experience in application development using Core Java, Microservices, Spring\n• 12 Years of experience in developing and deploying Java based application in AWS\n• 12 Years of experience in UI development using Angular\n• 12 Years of experience in Oracle, PL-SQL\n• Must be able to relocate to Houston, TX\n• Limited immigration sponsorship may be available\n• Travel up to 10% annually\n\t\t\t\t",
            "postedDate": "February 04, 2022",
            "compName": "Deloitte"
        },
        {
            "title": ".Net Senior Principal Software Engineer",
            "location": "Bucharest, 010200, Romania",
            "description": "\n\t\t\t\t\tJoin us as a Senior Principal Software Engineer on our Information Technology team in Bucharest to do the best work of your career and make a profound social impact.\n\nThe Software Engineering team delivers next-generation software application enhancements and new products for a changing world. Working at the cutting edge, we design and develop software for platforms, peripherals, applications, and diagnostics — all with the most advanced technologies, tools, software engineering methodologies and the collaboration of internal and external partners.\n\nWhat you’ll achieve\nAs a Senior Software Principal Engineer, you will be responsible for developing sophisticated systems and software basis the customer’s business goals, needs and general business environment creating software solutions.\n\nYou will:\n• Design and lead the effort on automation, CI/CD processes and tools to make our services simpler and more robust\n• Mentor team members in design collaboration, code reviews, development tools and processes\n• Take part in the full software development life cycle including development, test, continuous delivery and support\n• Be an active member of an agile team, collaboratively realizing features through development, test and delivery\n\nTake the first step towards your dream career\n\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n• Strong experience with software development and with bachelor’s or master’s degree in computer science or related field\n• Proven C# skills with experience on .net Frameworks and ability to apply Design Patterns.\n• Experience working with source code repositories and proficient at implementing web applications using REST.\n• Strong analytical, problem solving and prioritization skills - showing good command of English.\n• Excellent teamwork / collaboration skills, and proactive stance, being able to quickly adapt to new information and develop comprehensive knowledge of our IT ecosystem.\n\nDesirable Requirements\n• Knowledge of Data Storage stacks including SQL Database, good understanding of CI/CD concepts and experience with .net Core, TDD (Test Driven Development) and BDD (Behavior Driven development) using Testing frameworks (Selenium, xUnit, Specflow)\n• NON-SQL data stores (MongoDB), TFS or GitLab.\n• Experience with Cloud Computing, Message Queue Brokers, No-SQL DB, PowerShell, Docker, Kubernetes\n\nHere’s our story; now tell us yours\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nFull time\n\nR164166\n\t\t\t\t",
            "postedDate": "March 10, 2022",
            "compName": "Dell"
        },
        {
            "title": "Full Stack Software Engineer",
            "location": "Tampa, FL, 33647",
            "description": "\n\t\t\t\t\tRole Value Proposition:\nThe associate will be a critical member of Investments IT Core Data Services team supporting the Investments data warehouse and reporting. The successful candidate will be a self-starter with strong development and analytical skills.\n\nKey Responsibilities:\nResponsible for implementing enhancements to Investment’s data warehouse reporting and handling queries from Investment business partners\nParticipates in the creation of architectural specifications, ensuring feasibility, functionality, and integration with existing systems/platforms\nLeads the collection and documentation of user requirements as well as the development of user stories and estimates into technology solutions for product features, in collaboration with Product Owner\nResponsible for detailed technical design and development of applications using existing technology platforms. May partner with Product owner in planning. Responsible for front & back-end development.\nReviews solution designs and related code\nInvestigate and resolve production management incidents, problems, and service requests.\nResponsible for prioritizing problems, incidents, and service requests, may lead or manage process with Product Owner.\nIdentifies and implements operating efficiency solutions for specific product feature\nGain awareness of trends and issues in area of technical expertise, potential new technologies or technology opportunities to champion the customer.\n\nEssential Business Experience and Technical Skills:\nRequired:\n7+ years developing in SQL, SSIS, and SSRS within Visual Studio.\nPower BI, Power Apps\nSounds understanding of Data Warehouse concepts.\nC#., Net framework, WebAPI\nUnderstanding of Agile methodology\n\nPreferred:\nAzure PaaS with components like Data Lake, Databricks, Synapse Analytics\nProven ability to meet deadlines, while maintaining accuracy\nStrong analytical and design skills\nCapital Market securities knowledge is a plus\n\nBusiness Category\nGlobal Technology_31506\n\nTravel\n0\n\nNumber of Openings\n1\n\nAt MetLife, we’re leading the global transformation of an industry we’ve long defined. United in purpose, diverse in perspective, we’re dedicated to making a difference in the lives of our customers.”\n\nMetLife:\nMetLife, through its subsidiaries and affiliates, is one of the world’s leading financial services companies, providing insurance, annuities, employee benefits and asset management to help its individual and institutional customers navigate their changing world. Founded in 1868, MetLife has operations in more than 40 countries and holds leading market positions in the United States, Japan, Latin America, Asia, Europe and the Middle East.\n\nWe are one of the largest institutional investors in the U.S. with $642.4 billion of total assets under management as of March 31, 2021. We are ranked #46 on the Fortune 500 list for 2021. In 2020, we were named to the Dow Jones Sustainability Index (DJSI) for the fifth year in a row. DJSI is a global index to track the leading sustainability-driven companies. We are proud to have been named to Fortune magazine's 2021 list of the \"World's Most Admired Companies.\"\n\nMetLife is committed to building a purpose-driven and inclusive culture that energizes our people. Our employees work every day to help build a more confident future for people around the world.\n\nWe want to make it simple for all interested and qualified candidates to apply for employment opportunities with MetLife. For further information about how to request a reasonable accommodation, please click on the Disability Accommodations link below.\n\nMetLife is a proud Equal Employment Opportunity and Affirmative Action employer dedicated to attracting, retaining, and developing a diverse and inclusive workforce. All qualified applicants will receive consideration for employment at MetLife without regards to race, color, religion, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity or expression, age, disability, national origin, marital or domestic/civil partnership status, genetic information, citizenship status, uniformed service member or veteran status, or any other characteristic protected by law.\n\nMetLife maintains a drug-free workplace.\n\nRequisition #: 123944\n\t\t\t\t",
            "postedDate": "March 08, 2022",
            "compName": "MetLife"
        },
        {
            "title": "Software Security Engineer",
            "location": "Chennai, Tamil Nadu, India",
            "description": "\n\t\t\t\t\tResponsibilities\n•Implement, test and operate advanced software security techniques in compliance with technical reference architecture\n•Perform on-going security testing and code review to improve software security\n•Troubleshoot and debug issues that arise\n•Provide engineering designs for new software solutions to help mitigate security vulnerabilities\n•Contribute to all levels of the architecture\n•Maintain technical documentation\n•Consult team members on secure coding practices\n•Develop a familiarity with new tools and best practices\nRequirements\n•Proven work experience as a software security engineer\n•Detailed technical knowledge of techniques, standards and state-of-the art capabilities for authentication and authorization, applied cryptography, security vulnerabilities and remediation\n•Software development experience in one of the following core languages: Ruby on Rails, Java, JavaScript and .NET\n•Adequate knowledge of web related technologies (Web applications, Web Services and Service Oriented Architectures) and of network/web related protocols\n•Interest in all aspects of security research and development\n•BS degree in Computer Science or related field\nLocation: Chennai\n\nKindly share your CV to mail and WhatsApp\nContact hr\n9176304925.\n\t\t\t\t",
            "postedDate": "January 08, 2022",
            "compName": "Brightstone Pvt Ltd."
        },
        {
            "title": "Reservoir Engineer",
            "location": "Kampala, Uganda",
            "description": "\n\t\t\t\t\tThe Uganda National Oil Company (UNOC) Ltd was established under the Petroleum (Exploration, Development, and Production) Act and the Petroleum (Refining, Conversion, Transmission, and Midstream Storage) Act, both of 2013 and incorporated under the Companies Act, 2012.\nIt is a limited liability company wholly owned by the Government of Uganda.\nThe overall function of UNOC is to handle the State’s commercial interests in the Oil and Gas industry and ensure that the resource is exploited in a sustainable manner.\nUNOC now invites applications for persons interested to develop their career with a dynamic results-oriented Company to occupy the following positions: Upstream Department Job Title: Reservoir Engineer (1 Vacancy) Reports To: Reservoir Engineer Specialist Job Purpose: Responsible for identifying and quantifying oil and gas reserves and developing strategies to maximize recovery.\nEssential Duties • Liaise with geoscientists, production, and petroleum engineers to develop subsurface dynamic reservoir models and predict production potential.\n• Provide reservoir engineering inputs required for the preparation of Field Development Plans and Reservoir Management Plans, such as predicted production profiles, well count, data acquisition plans, etc.\nPerform the development, maintenance, and history matching of dynamic reservoir simulation models.\n• Participate in the estimation of the petroleum resources/reserves including the development of production and reserve booking profiles.\n• Evaluate partners’ reservoir engineering proposals and participate in meetings with • Partners and Authorities, when required.\n• Assess opportunities for future infill wells, workovers, near-field exploration targets, and enhanced oil recovery and prepare appropriate recommendations.\n• Assist in the development of operational procedures for E&P operations and in ensuring that all operations are conducted according to approved procedures.\nSupport an integrated team of geoscientists, drilling, and production engineers to monitor field performance and optimize production.\n• Monitor the acquisition of engineering data to ensure quality and adequately.\n• Perform any other duties as may be assigned.\nQualifications, Experience and Attributes: o Bachelor’s Degree (Hons) in Engineering, Geosciences, or any relevant degree.\nb) Minimum of 5 years’ experience in Petroleum E&P Operations.\n• Substantial experience in dynamic modelling of petroleum reservoirs, history matching, and sensitivity analysis using Eclipse (or similar software). Be skilled in integrated reservoir modelling and simulation.\nHave knowledge of development and production operations, Health & Safety standards, and operational procedures.\n• Ability to work independently, but also work effectively within a multi-disciplinary team environment to develop appropriate work programs.\n\t\t\t\t",
            "postedDate": "March 08, 2022",
            "compName": "China National Offshore Oil Corporation Uganda"
        },
        {
            "title": "Telco Software Engineer 2 - QA Automation",
            "location": "El Esmaileyah, Cairo, 11, Egypt",
            "description": "\n\t\t\t\t\tTelco Software Engineer 2 - QA Automation\nJoin us as a Software Engineer 2 on our Telco team in Cairo to do the best work of your career and make a profound social impact.\nThe Software Engineering team delivers next-generation application enhancements and new products for a changing world.\n\nSoftware Engineer 2 who has a strong background in highly scalable distributed systems with experience working in an agile engineering team and a knack for researching new technologies.\n\nDell Telecom Systems Business Unit\nWe create products and solutions catering for the worldwide telecommunications market, which is exploding with new and exciting opportunities made possible by new developments as virtualized radio access networks (RANs). The market consists of communication service providers, managed service providers, hosting companies, content delivery network companies, cloud service providers, and consumer/enterprise web-technology providers.\nOur engineering team is responsible for the creation and delivery of great software products and solutions, as well as services offerings for and to this market. The team works closely with a world-class product management team in defining and road-mapping the offerings. We take pride in creating top market products which are unique, cutting-edge, and win the confidence of Telecom customers.\n\nWhat you’ll achieve\nAs a Software Engineer 2, you will work with a cross functional global team to design, build and deliver production ready software with Dell standards.\n\nYou will:\n\nDemonstrate your ability to design, code, test, and deliver Dell’s Bare Metal orchestrator product for our Telecom Systems Business\n\nWorking independently and as part of a Software Agile Development team\n\nReview and analyze different software requirements and come up with testing strategy and plan to execute different kind of tests in automated manner\n\nDrive, coordinate and execute functional & non-functional tests including different system performance tests\n\nCollaborate with members of the test team to develop effective strategies and test plans\n\nDevelop test cases and test automation scripts, execute test cases, analyze, and document result\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n\n2 - 5 years of related experience in Quality & Test Automation roles\n\nKnowledge of Object-oriented programming & Data Structures\n\nExperience with developing automated test cases and working with an automated test framework\n\nExperience with Agile Software Development methodology & DevOps lifecycle\n\nProficiency in the following languages Knowledge mainly Python and extra C++/Java/ Selenium\n\nExcellent verbal and written communication skills\n\nExperience of micro-services APIs, Web Services, JSON\n\nKnowledge of Container Technologies (Dockers, Kubernetes) and Containers Network Interface.\n\nDesirable Requirements\nGraduate from Computer Science or a related field\n\nPreferred experience:\nNetwork basics (TCP/IP stack, networking, security, and common Internet services/protocols such as SNMP, DNS, LDAP, NTP, HTTP)\n\nHere’s our story; now tell us yours\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR169126\n\t\t\t\t",
            "postedDate": "March 09, 2022",
            "compName": "Dell"
        },
        {
            "title": "Devops Engineer (F/M/D) Hamburg / Germany",
            "location": "Bahrenfeld, 22525, Germany",
            "description": "\n\t\t\t\t\tJob description\nOur customer has been the driver of innovations in the field of “secure data” for over 250 years and develops products and solutions for secure identities, secure data and secure infrastructures. The group of companies currently employs a total of more than 3,000 people\nSecure identities, secure data and infrastructures are our core competencies for a responsible design of digital change.\n\nWhat do we need for this?\nGreat people full of ideas and energy who do their best every day. What you can expect: a wide range of activities and countless opportunities for further development.\nShape the digital future with us! We are looking for personalities with team spirit who share our passion for protecting identities and data, think ahead and want to work with us on secure digitization solutions.\n\nTasks\n\nStrengthening of the platform and developer experience teams with a focus on cloud native technology stack\nConstruction and operation of environments in the areas of private and public cloud\nIndependent development of managed services for use in software solutions\nTechnical advice to the product owners and software engineering teams on product and project requirements\nProcess automation including continuous integration, continuous delivery and test automation as well as carrying out independent administration and configuration activities\nEvaluation of new technologies and continuous training\nDocumentation of best practice approaches and support for cross-departmental knowledge exchange\n\nEssential qualifications\n\nSuccessfully completed studies in computer science or a comparable subject or IT-technical training with relevant professional experience in a comparable\nposition\nExpertise in dealing with Enterprise Kubernetes, ideally knowledge of Red Hat OpenShift and the operation of hybrid cloud environments with AWS\nExperience in one or more of the following technologies: Keycloak, HashiCorp Vault, Elastic Stack, RabbitMQ, Apigee, JupyterHub\nKnow-how in the implementation of CI/CD pipelines and in the deployment of large software applications is advantageous\nKnowledge of microservices architectures and API design (REST, messaging)\nBasic understanding of network infrastructures (routing, load balancing, DNS)\nAnalytical, service-oriented way of working and enjoy working in agile teams (Scrum, Kanban)\nDesired language skills\n\nGerman – (B2-C1)\nEnglish – (B2-C1)\n\nLocation:\nBonn – Germany\n\nWorking mode:\nHybrid\n\nCompensation & Benefits\n\nSalary range\n\n€56,000.00 – €70,000.00 annually\n\nHolidays\n30 days\n\nJob benefits\n\nFlexible working hours\nIn-house canteen\nEmployee discounts\nFlat hierarchy\nFitness and health programs\nMeal allowance\nFamily Friendly\nPension or retirement plans\nEducation and career development\nCompany phone\nPossible relocation package\n\t\t\t\t",
            "postedDate": "February 08, 2022",
            "compName": "LEXEM Consulting s.r.o."
        },
        {
            "title": "Principal Software Engineer AI ML Platform Engineering",
            "location": "Austin, TX",
            "description": "\n\t\t\t\t\tIT Principal Software Engineer\nBe a part of a team that’s ensuring Dell Technologies' product integrity and customer satisfaction. Our IT Software Engineering team turns business requirements into technology solutions by designing, coding and testing/debugging applications, as well as documenting procedures for use and constantly seeking quality improvements.\n\nJoin us as a Principal Software Engineer on our Software Engineering team in Austin / Round Rock, TX (Open to US Remote) to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\nAs a Principal Software Engineer, you will be part of our AI ML Platform Engineering team that is spearheading Dell’s Digital Transformation by driving innovation in the way we deliver advanced AI and ML technologies that can help our business units deliver improvements across our entire customer experience and optimize our business outcomes. We design and develop software with the most advanced technologies, tools, software engineering methodologies and the collaboration of internal and external partners.\n\nThis position will merge software engineering, modern dev ops, data engineering and deployment at scale to help teams deploy algorithmic models that can optimize business and customer experiences at scale. The candidate will use technical knowledge and software development to build technology centric solutions that accelerate the development of AI and ML capabilities across the company.\n\nYou will:\n\nDesign and develop software internal and external customer products.\n\nUtilize a range of applicable technologies (e.g., programming languages, compilers, assemblers, debuggers, other tools) for products used in local, networked, storage enhancements and/or new systems.\n\nParticipate in product development in all stages from planning and design to development, testing, deployment and documentation.\n\nGenerate technical documentation as well as unit and functional tests.\n\nCollaborate in training, work assignment and mentoring of developers and provide training and mentor other engineers when required.\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n\nEngineering Degree in Computer Science/Engineering, or equivalent professional experience.\n\n6 to 8 years of related experience in a professional role with a Bachelor’s degree; or 4 to 6 years with a Master’s degree.\n\nDemonstrated experience writing, documenting and maintaining high quality code with object-oriented programming languages such as C# or Java.\n\nExperience with cloud-native computing, cloud platforms, microservices architecture, modern DevOps, Test Development and Continuous Integration / Continuous Deployment.\n\nExperience with Kubernetes, Docker, Functions, elastic compute, enterprise-scale platforms, parallelized workloads, real-time data streams, open source frameworks, Python, Gitlab, and Apache.\n\nDesirable Requirements\n\nExperience running and optimizing Data Science and Machine Learning workloads.\n\nKnowledge of Data Science tools, frameworks and techniques.\n\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR166785\n\t\t\t\t",
            "postedDate": "March 09, 2022",
            "compName": "Dell"
        },
        {
            "title": "Software Engineer",
            "location": "Pune, Maharashtra, India",
            "description": "\n\t\t\t\t\tPrimary Skill :\nSecondary Skill :\nOther Skills :\nOrganizational Level 1 :\nOrganizational Level 2 :\nManager : Anoop Mahajan\nLocation: India- Pune (Amdocs Site)\nTalent Acquisition: Vijayeta Singh\nRequired Travel : Minimal\nOpen to Relocation :\nReferral Bonus Reward Amount* : Rs25,000.00\n* In case this job is open for Amdocs employees only \"Refer Friend to Job\" option is disabled\n\nWho are we?\n\nIf you’re a smartphone user then you are part of an ever more connected and digital world. At Amdocs, we are leading the digital revolution into the future. From virtualized telecommunications networks, Big Data and Internet of Things to mobile financial services, billing and operational support systems, we are continually evolving our business to help you become more connected. We make sure that when you watch a video on YouTube, message friends on Snapchat or send your images on Instagram, you get great service anytime, anywhere, and on any device. We are at the heart of the telecommunications industry working with giants such as AT&T, Vodafone, Telstra and Telefonica, helping them create an amazing new world for you where technology is being used in amazing new ways every single day.\n\nIn one sentence\n\nResponsible for design, development, modification, debug and/or maintenance of software systems\n\nWhat will your job look like?\n\n• You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.\n• You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.\n• You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.\n• You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.\n• You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.\n• You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.\n\nAll you need is...\n\n• Bachelor's degree in Science/IT/Computer Science or equivalent\n• 3+ years Java experience (server side) on Linux/Unix/Windows\n• Demonstrable experience with the Spring framework components - Spring Boot, MVC, Integration, Security, etc.\n• Strong understanding of RESTful APIs and open systems\n\nWhy you will love this job:\n\n• You will be challenged to design and develop new software applications.\n• You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.\n\nAmdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce\n\t\t\t\t",
            "postedDate": "March 05, 2022",
            "compName": "Amdocs"
        },
        {
            "title": "Staff Engineer - Growth Alliance (m/f/x)",
            "location": "Kreuzberg, 10969, Germany",
            "description": "\n\t\t\t\t\tAt HelloFresh, we want to change the way people eat forever by offering our customers high quality food and recipes for different meal occasions. Over the past 10 years, we've seen this mission spread around the world and beyond our wildest dreams. Now, we are a global food solutions group and the world's leading meal kit company, active in 16 countries across 3 continents. So, how did we do it? Our weekly boxes full of exciting recipes and fresh ingredients have blossomed into a community of customers looking for delicious, healthy and sustainable options. The HelloFresh Group now includes our core brand, HelloFresh, as well as: GreenChef, EveryPlate, Chef's Plate, Factor, and Youfoodz.\nThe role\nAs a Staff Engineer in the Growth Alliance, you will be responsible for helping to design and develop resilient, scalable and flexible software to support our impressive growth as we scale up our technologies and teams. You are responsible for supporting the design, development, and maintenance of our software across multiple teams with various dependencies. Alongside being the hands on expert within a domain, you will be challenged as a senior technical leader and have an opportunity to work with highly competent colleagues on challenging engineering problems and have a great impact on the organisation. The role will offer you an opportunity to be able to dive deep into architectural topics and really help shape our future.\nGrowth Alliance’s mission is to “Build tools and services to empower HelloFresh businesses to convince more customers to try, recommend or return to our products.”\nAbove all, we are looking for people who will make HelloFresh better. We believe there are many different ways of developing skills and we love diverse experiences! So even if you don’t “tick all the boxes” but think you’d thrive in this role, we would really like to learn more about you.\nWhat you’ll do\nBe able to take responsibility for end-to-end software design and development processes, across the entire tech organization when needed.\nCooperate with other senior engineers to promote best practices in software architecture, design, development, delivery and deployment, and operations (DevOps Practices, Pair Programming, TDD, streaming, pub/sub, etc.)\nLead teams in ensuring we are adopting and using effectively state-of-the-art technologies.\nBe actively involved in large, strategic tech initiatives, such as distributed data mesh, streaming data, microservice architectures, code refactoring best practices, API definition, CI/CD implementation and more.\nCollaborate closely with our leadership in Tech, Product, Data and Business to improve our process, methodologies, communication flows, etc.\nBe an ambassador for HelloTech brand and partners in hiring to our Talent Acquisition Team.\nWhat you’ll bring\nStrong engineering and architecture experience and extensive knowledge in APIs and Microservices.\nSolid programming and architectural skills in one or more of our core languages: Golang, Kotlin or Python.\nProfessional knowledge and experience of commonly used technologies: Kafka, AWS, Kubernetes, SQL as well as best practices.\nAn ability to act as an advocate for best tech practices, such as CI/CD, TDD, BDD, DDD, Design Patterns.\nExperience in improving the environment in which you are working, for technology, methodology, and team collaboration.\nThe ability to mentor other developers and host knowledge sharing sessions.\nAn agile mindset with the ability to advocate for cross-functional collaboration.\nWhat we offer\nComprehensive relocation assistance to move to Berlin plus visa application support\nHealthy discount on weekly HelloFresh boxes\nAnnual learning and development budget to attend conferences or purchase educational resources plus access to the HelloFresh Academy\nSubsidised childcare with a professional nannying agency\nFree access to Headspace, biweekly in-house yoga classes (remote since March 2020)\nA diverse and vibrant international environment of 70+ different nationalities\nAdditional perks include: Free crash course in German, compensation for advanced external German classes, discounts for our neighbouring gym & Urban Sports Club, summer & winter parties, discount on our HelloFresh GO vending machines\nThe chance to have a significant impact on one of the fastest-growing technology companies in Europe in an exciting growth phase\n\nAbout HelloFresh\n\nWe believe that sharing a meal brings people of all identities, backgrounds, and cultures together. We are committed to celebrating all dimensions of diversity in the workplace equally and ensuring that everyone feels a sense of inclusion and belonging. We also aim to extend this commitment to the partners we work with and the communities we serve. We are constantly listening, learning, and evolving to deliver on these principles. We are proud of our collaborative culture. Our diverse employee population enables us to connect with our customers and turn their feedback into meaningful action - from developing new recipes to constantly improving our process of getting dinner to our customers’ homes. Our culture attracts top talent with shared values and forms the foundation for a great place to work!\nAt HelloFresh, we embrace diversity and inclusion. We are an equal opportunity employer and do not discriminate on the basis of an individual's race, national origin, color, gender, gender identity, gender expression, sexual orientation, religion, age, disability, marital status or any other protected characteristic under applicable law, whether actual or perceived. As part of the Company’s commitment to equal employment opportunity, we provide reasonable accommodations, up to the point of undue hardship, to candidates at any stage, including to individuals with disabilities.\n\t\t\t\t",
            "postedDate": "March 01, 2022",
            "compName": "Hellofresh"
        },
        {
            "title": "Telco Software Engineer 2 - Full Stack",
            "location": "El Esmaileyah, Cairo, 11, Egypt",
            "description": "\n\t\t\t\t\tTelco Software Engineer 2 - Full stack\nJoin us as a Software Engineer 2 on our Telco team in Cairo to do the best work of your career and make a profound social impact.\nThe Software Engineering team delivers next-generation application enhancements and new products for a changing world.\n\nSoftware Engineer 2 who has a strong background in highly scalable distributed systems with experience working in an agile engineering team and a knack for researching new technologies.\n\nDell Telecom Systems Business Unit\nWe create products and solutions catering for the worldwide telecommunications market, which is exploding with new and exciting opportunities made possible by new developments as virtualized radio access networks (RANs). The market consists of communication service providers, managed service providers, hosting companies, content delivery network companies, cloud service providers, and consumer/enterprise web-technology providers.\nOur engineering team is responsible for the creation and delivery of great software products and solutions, as well as services offerings for and to this market. The team works closely with a world-class product management team in defining and road-mapping the offerings. We take pride in creating top market products which are unique, cutting-edge, and win the confidence of Telecom customers.\n\nWhat you’ll achieve\nAs a Software Engineer 2, you will work with a cross functional global team to design, build and deliver production ready software with Dell standards.\n\nYou will:\n\nDemonstrate your ability to design, code, test, and deliver Dell’s Bare Metal orchestrator product for our Telecom Systems Business\n\nContribute to the effort on automation, CI/CD processes and tools to make our services simpler and more robust\n\nBe an active member of an agile team, collaboratively realizing features through development, test, and delivery\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nDesirable Requirements\nGraduate from Computer Science or a related field\n\nEssential Requirements\n\n2 - 5 years of related experience\n\nKnowledge of Object-oriented programming & Data Structures\n\nProficiency in one or more of the following languages (Java, Golang, Python, C/C++)\n\nExperience with front-end HTML5/CSS/JavaScript (jQuery, Bootstrap, extJS, Knockout, Angular, React, Vue)\n\nExperience of micro-services APIs, Web Services, JSON\n\nPreferred knowledge of Container Technologies (Dockers, Kubernetes) and Containers Network Interface.\n\nPreferred experience:\nNetwork basics (TCP/IP stack, networking, security, and common Internet services/protocols such as SNMP, DNS, LDAP, NTP, HTTP)\n\nKey Responsibilities\n\nImplementation and delivery of Bare metal orchestrator solution (BMO) using Agile methodologies\n\nKey player in the complete software life cycle from requirements leading to design and development in CI/CD frameworks\n\nDemonstrate the ability to work and thrive in fast paced virtual development environments\n\nHere’s our story; now tell us yours\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR168785\n\t\t\t\t",
            "postedDate": "March 09, 2022",
            "compName": "Dell"
        },
        {
            "title": "Senior System Software Engineer - Security",
            "location": "Santa Clara, CA",
            "description": "\n\t\t\t\t\tWe are looking for a Senior System Software - Security!\n\nNVIDIA’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined modern computer graphics, and revolutionized parallel computing. More recently, GPU deep learning ignited modern deep learning — the next era of computing — with the GPU acting as the brain of computers, robots, and self-driving cars that can perceive and understand the world. Today, we are increasingly known as “the AI computing company.” We're looking to grow our company and establish teams with the most thoughtful people in the world. Are you ready to change the next generation of computing? Join us at the forefront of technological advancement.\n\nWhat you’ll be doing:\n\nDesign and implement security/cryptography related software for NVIDIA server platforms from requirements to production and commercial deployment.\n\nResponsible for implementing the Unified Firmware security architecture across platforms and keeping task tracking systems up to date in an agile development environment.\n\nAnalyze and enhance security, efficiency, stability, scalability of system resources and assess third party and open source software for security vulnerabilities.\n\nYou are responsible for developing and reviewing code, reviewing design documents, use case reviews, and test plan review.\n\nWork with test engineers to develop proper security testing strategies.\n\nProvide software quality reports based on static analysis, code coverage, CPU load.\n\nWork with the security team to ensure developed code is in line with product security goals and drive product life cycles with QA teams to productize the module, and be responsible as a product owner.\n\nGenerate API documentation from code using Swagger or similar tools, as well as help generate content for user guides to pursue customer problems etc.\n\nWhat we need to see:\n\nDeep understanding of SW product development lifecycle and understanding of PKI, X.509 certificate and security provisioning.\n\nProven working experience in security/cryptography software development and troubleshooting on embedded systems.\n\nYou should possess excellent programming and scripting skills using C/C++, Bash, Python, etc. both for Linux user-space programs and system programs with thorough code reviewing skills.\n\nFamiliar with cryptographic algorithms (such as AES, SHA, RSA, ECC), security protocols (such as TLS, IPSEC), and secure coding and static analysis tools.\n\nFamiliarity with secure boot, secure firmware update, code signing, hardware root-of-trust, Trusted Platform Module 2.0 (TPM 2.0) and firmware attestation techniques.\n\nExperience in baseboard management controller (BMC), IDS/IPS and familiarity with BMC related protocols is plus.\n\nExperience in driving ideas from architecture to implementation and getting sign-off from all partners in tight schedules.\n\nStrong in Linux fundamentals, various Linux distributions and packages, Linux upgrade mechanisms, building and deploying Linux images.\n\nBachelor of Science Degree in Electrical Engineering or Computer Science, Master’s Degree, or a PhD; or equivalent experience.\n\nAt least 4 years of experience.\n\nWays to stand out from the crowd:\n\nContributor to industry standards like Open Compute Project (OCP), OpenBMC, DMTF, TCG and to open source projects.\n\nExpertise in system software and platform security for x86/ARM based Rack/Blade server systems.\n\nExperience with writing automated unit test suites for each implemented module and maintain detailed unit test case reports.\n\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people on the planet working for us. If you're creative and autonomous, we want to hear from you!\n\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.\n\nFull time\n\nJR1955830\n\t\t\t\t",
            "postedDate": "March 10, 2022",
            "compName": "NVIDIA"
        },
        {
            "title": "Senior Completion / Well Engineer",
            "location": "Kampala, Uganda",
            "description": "\n\t\t\t\t\tMain Duties and Responsibilities • Share Adopt and demonstrate an exemplary behavior with regard to HSE rules with associated implementation and control within his area of responsibility.\n• Participate of the evaluation and clarifications of the Call For Tender and RFQ exercises needed to the smooth running of operations.\n• Prepare and QAQC wells AFE (CAPEX and OPEX). • Perform wells engineering studies and wells software simulations to select best productivity completion design taking into account complex fluids properties (Waxy and viscous oil). • Assist the Head of wells engineering for the preparation of the General completion Program.\n• Participate in the preparation of well’s SOR in collaboration with drilling engineering team and GSR team, with special focus on well productivity.\n• Assist in preparation of detailed completion programs and issue reports and studies on specific productivity issues (downhole activation selection, reservoir drawdown). • Investigate new equipment with Contractors and simplification of artificial lift equipment range.\n• Involved in completion, well intervention and rigless operations (day to day with operational people) and identify improvements.\n• Assist in preparation of technical input to interactions with authorities and partners.\n• Prepare End Of Well Report.\n• Consolidate lessons learnt in “REX”. • Participate to the Completion Improvement Process system.\n• Participate in HSE audits, Incident investigations, SQMs.\n• Assist in preparation of pre-spud meetings and participate in same.\n• Assist in preparation of derogation dossiers.\n• Mentoring and training of Junior staff Context and environment Candidate profile • Petroleum Industry Masters (or equivalent professional experience) • A Minimum 4 year of experience with ESP systems is compulsory.\n• Driven, good team spirit and communication skills (written and verbal).\n\t\t\t\t",
            "postedDate": "March 09, 2022",
            "compName": "TotalEnergies"
        },
        {
            "title": "Tech Engineer Python",
            "location": "Pune, Maharashtra, India",
            "description": "\n\t\t\t\t\tRequisition Number\n246983BR\n\nYour role\n\nAre you an excellent problem solver, who is passionate about latest technology and innovation? Is agile your way of life? Are you excited by cloud technologies? Do you love to code and get into the details? Are you passionate about software development and building cloud native applications? Do you enjoy automating software delivery and achieve 1 click build and deployment? Can you communicate efficiently, and influence quicker deliveries? Do you want to be part of an exciting journey as we build our new application from scratch? Join us,\n\nWe’re looking for a Azure Data Bricks and Python/Java Engineer to:\n\n• provide technology solutions that will solve business problems and strengthen our position as digital leaders in financial services\n• design, plan and deliver sustainable solutions using modern programming languages including Python, Apache Spark and Java for the Treasury Liquidity and Funding line of business\n• help us in our journey as we move to Azure and build a new Azure-native application\n• help lead our growing team of analysts and engineers to build a new application\n• provide technical expertise and recommendations in assessing requirements and initiatives to support and enhance our existing applications\n• conduct code reviews and test software as needed, along with participating in application architecture and design and other phases of SDLC\n• see that proper operational controls and procedures are implemented\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou’ll be working in the Group Treasury Technology Team in India (Pune). Group Treasury Technology provides the Technology support for the bank's Liquidity and Funding as well as Asset and Liability Management lines of business. We support our business partners managing, control and optimize the capital, liquidity, funding and inter-group engagements across the bank and its legal entities.\nIt is an exciting time to be a part of our team based in Zurich, UK, Poland and India as we embark on a journey to build a new business critical application. We plan to grow our presence in India.\nOur culture centers around collaboration, transparency, accountability and quality.\n\nYour expertise\n7+ years’ experience working as software engineer\n• very experienced and proficient with coding in Python, PySpark producing secure and clean code that is stable, operational, consistent and well-performing\n• Demonstrable knowledge of good software design\n• knowledgeable with implementation of analysis tools and dashboards in Power BI and Azure Databricks workbooks\n• experience with working as a part of a geographically distributed team is a plus\n• comfortable communicating in English\n• excellent understanding of data modelling, SQL and OLAP principles\n• experienced with DevOps practices, CI/CD, build and test automation\n• AZ-204 \"Microsoft Certified Azure Developer Associate\" or any advanced Azure certifications will be a huge plus\n• able to analyze user stories together with the product owner, the IT business analyst, QA engineer and other developers\n• experience with implementing Liquidity and Funding quantitative models, big data and analysis solutions in an Azure based big data environment is a plus\n• experienced with design, plan and deliver solutions in a large scale enterprise environment based on Azure\n• ability to work collaboratively with key users and stakeholders to run workshops, establish user stories and understand business processes, gather and challenge requirements, and encourage continuous feedback\n• working knowledge of the financial sector and banking products, ideally good understanding of Liquidity and Funding Management and models\n• bachelor’s or master’s degree or equivalent with a focus in computer science or engineering\n• excellent interpersonal skills to form productive and collaborative relationships\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nContact Details\nUBS Recruiting India\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Software Engineer",
            "location": "Tamansari, 11140, Indonesia",
            "description": "\n\t\t\t\t\tJob ID: 113620\nRequired Travel :Minimal\nManagerial - No\nLocation: :Indonesia- Jakarta (Customer Site)\n\nWho are we?\n\nIf you’re a smartphone user then you are part of an ever more connected and digital world. At Amdocs, we are leading the digital revolution into the future. From virtualized telecommunications networks, Big Data and Internet of Things to mobile financial services, billing and operational support systems, we are continually evolving our business to help you become more connected. We make sure that when you watch a video on YouTube, message friends on Snapchat or send your images on Instagram, you get great service anytime, anywhere, and on any device. We are at the heart of the telecommunications industry working with giants such as AT&T, Vodafone, Telstra and Telefonica, helping them create an amazing new world for you where technology is being used in amazing new ways every single day.\n\nIn one sentence\n\nResponsible for design, development, modification, debug and/or maintenance of software systems\n\nWhat will your job look like?\n\n• You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.\n• You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.\n• You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.\n• You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.\n• You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.\n• You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.\n\nAll you need is...\n\n• Bachelor's degree in Science/IT/Computer Science or equivalent\n• 3+ years Java experience (server side) on Linux/Unix/Windows\n• Demonstrable experience with the Spring framework components - Spring Boot, MVC, Integration, Security, etc.\n• Strong understanding of RESTful APIs and open systems\n\nWhy you will love this job:\n\n• You will be challenged to design and develop new software applications.\n• You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.\n\nAmdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce\n\t\t\t\t",
            "postedDate": "March 05, 2022",
            "compName": "Amdocs"
        },
        {
            "title": "Software Engineer",
            "location": "Pune, Maharashtra, India",
            "description": "\n\t\t\t\t\tJob ID: 127532\nRequired Travel :Minimal\nManagerial - No\nLocation: India- Pune (Amdocs Site)\n\nWho are we?\n\nIf you’re a smartphone user then you are part of an ever more connected and digital world. At Amdocs, we are leading the digital revolution into the future. From virtualized telecommunications networks, Big Data and Internet of Things to mobile financial services, billing and operational support systems, we are continually evolving our business to help you become more connected. We make sure that when you watch a video on YouTube, message friends on Snapchat or send your images on Instagram, you get great service anytime, anywhere, and on any device. We are at the heart of the telecommunications industry working with giants such as AT&T, Vodafone, Telstra and Telefonica, helping them create an amazing new world for you where technology is being used in amazing new ways every single day.\n\nIn one sentence\n\nResponsible for design, development, modification, debug and/or maintenance of software systems\n\nWhat will your job look like?\n\n• You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.\n• You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.\n• You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.\n• You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.\n• You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.\n• You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.\n\nAll you need is...\n\n• Bachelor's degree in Science/IT/Computer Science or equivalent\n• 3+ years Java experience (server side) on Linux/Unix/Windows\n• Demonstrable experience with the Spring framework components - Spring Boot, MVC, Integration, Security, etc.\n• Strong understanding of RESTful APIs and open systems\n\nWhy you will love this job:\n\n• You will be challenged to design and develop new software applications.\n• You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.\n\nAmdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce\n\t\t\t\t",
            "postedDate": "March 05, 2022",
            "compName": "Amdocs"
        },
        {
            "title": "Software Engineer",
            "location": "Pune, Maharashtra, India",
            "description": "\n\t\t\t\t\tJob ID: 141561\nRequired Travel :Minimal\nManagerial - No\nLocation: India- Pune (Amdocs Site)\n\nWho are we?\n\nAmdocs helps those who build the future to make it amazing. With our market-leading portfolio of software products and services, we unlock our customers’ innovative potential, empowering them to provide next-generation communication and media experiences for both the individual end user and enterprise customers. Our 28,000 employees around the globe are here to accelerate service providers’ migration to the cloud, enable them to differentiate in the 5G era, and digitalize and automate their operations. Listed on the NASDAQ Global Select Market, Amdocs had revenue of $4.3 billion in fiscal 2021. For more information, visit Amdocs at\n\nIn one sentence\n\nResponsible for design, development, modification, debug and/or maintenance of software systems\n\nWhat will your job look like?\n\n• You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications.\n• You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders.\n• You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions.\n• You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals.\n• You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements.\n• You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks.\n\nAll you need is...\n\nHaving 1-3 years of experience in C/C++ related technologies and able to work on Amdocs product customization development and provide related support.\nBe responsible for understanding customer requirements, review the scope with team, and deliver software artifacts \"on-time every time\" with \"zero defects\". Identify and roll out industry best practices with the team.\nBe a team player, collaborate and add value through participation in peer code reviews, provide comments and suggestions, work with cross functional teams to achieve goals.\nActively look for innovation and continuous improvement, efficiency in all assigned tasks.\n\nWhy you will love this job:\n\n• You will be challenged to design and develop new software applications.\n• You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.\n\nAmdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce\n\t\t\t\t",
            "postedDate": "March 04, 2022",
            "compName": "Amdocs"
        },
        {
            "title": "Software Test Engineer III",
            "location": "Bellingham, WA, 98226",
            "description": "\n\t\t\t\t\tEnerSys is the global leader in stored energy solutions for industrial applications. We have over thirty manufacturing and assembly plants worldwide servicing over 10,000 customers in more than 100 countries. Worldwide headquarters are located in Reading, PA, USA with regional headquarters in Europe and Asia. We complement our extensive line of Motive Power and Energy Systems with a full range of integrated services and systems. With sales and service locations throughout the world, and over 100 years of battery experience, EnerSys is the power/full solution for stored DC power products. We continue to grow in our industry by ensuring all employees possess the following core competencies: customer focused, team player, engaged, ethical, strong communication skills, and works safely.\nThis position will be focusing primarily on our Energy Systems line of business, which include telecommunications, IT, uninterruptible power supplies (UPS), utilities and switchgear, security, emergency lighting and general electronics. Some of the reserve power brands include PowerSafe,DataSafe, and Genesis. Our extensive product range serves a variety of reserve power applications and consistently delivers the most effective, powerful and reliable batteries available.\n\nJob Purpose\n\nWith limited supervision, the Software Test Engineer III will design, document and execute both manual and automated test procedures to test our in-house and customer-facing application software which runs on Windows, browser, iOS, and Android platforms. The successful applicant to this position will be called upon to advise and implement best practices in the application testing space as we continue to build our application test team.\n\nEssential Duties and Responsibilities\n\nCreate, maintain and execute detailed application test plans\nCreate detailed bug tickets with steps to reproduce\nIsolate issues to determine root causes\nCreate automated and manual unit, integration, system and performance tests, using both white-box and black-box methods\nReview detailed requirements for completeness and testability\nCreate and maintain software documentation\nKeep up to date on the latest industry trends in related technologies\nExplain technologies and solutions to technical and non-technical stakeholders\n\nQualifications\n\nBachelor of Science in Computer Engineering, Computer Science or equivalent relevant experience\n6+ years of relevant experience\nExcellent communication skills in English (verbal and written) to liaise with various departments locally and internationally\nProven commercial software test experience\nExcellent knowledge in information architecture, human computer interaction and usability design principles\nAbility to multi-task and good time management skills\nAbility to work on their own and as a part of the team\nExcellent scoping and estimation skills\nExcellent testing / QA skills\nWilling and able to adhere to common coding and documentation standards\nStrong attention to detail, highly organized\nWillingness to work early mornings and evenings occasionally\nStrong web application testing skills (preferably testing Angular-based single-page web applications)\nSolid knowledge of relational database systems (preferably SQL Server, TSQL)\nStrong HTML5 and CSS skills, including browser-based HTML and JS debugging skills\nExperience with web service integration (SOAP, REST, JSON, XML)\nExperience with web service tools (e.g., Postman, Fiddler2)\nStrong ability to reproduce and isolate root causes for issues found\nExperience reviewing and refining detailed requirements\nExperience writing automated unit, integration, and systems test cases\nExperience in Windows (required) and Linux (desired) environments\nExperience in several common scripting and compiled programming languages (C#/.Net preferred)\nA solid understanding of how web applications work including security, session management, etc.\nExperience with version control (e.g., SVN)\nExperience with one or more automated testing systems (e.g., Selenium, UFT, QTP)\n\nGeneral Job Requirements\nThis position will work in an office setting, expect minimal physical demands.\n\nEnerSys provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. EEO/M/F/Vets/Disabled\nEEO is the Law\nEEO is the Law Supplement\nPay Transparency Nondiscrimination\n\t\t\t\t",
            "postedDate": "February 16, 2022",
            "compName": "EnerSys Delaware"
        },
        {
            "title": "Staff Engineer - Food Alliance (m/f/x)",
            "location": "Kreuzberg, 10969, Germany",
            "description": "\n\t\t\t\t\tAt HelloFresh, we want to change the way people eat forever by offering our customers high quality food and recipes for different meal occasions. Over the past 10 years, we've seen this mission spread around the world and beyond our wildest dreams. Now, we are a global food solutions group and the world's leading meal kit company, active in 16 countries across 3 continents. So, how did we do it? Our weekly boxes full of exciting recipes and fresh ingredients have blossomed into a community of customers looking for delicious, healthy and sustainable options. The HelloFresh Group now includes our core brand, HelloFresh, as well as: GreenChef, EveryPlate, Chef's Plate, Factor, and Youfoodz.\nThe role\nAs a Staff Engineer in the Food Alliance, you will be responsible for helping to design and develop resilient, scalable and flexible software to support our impressive growth as we scale up our technologies and teams. You are responsible for supporting the design, development, and maintenance of our software across multiple teams with various dependencies. Alongside being the hands on expert within a domain, you will be challenged as a senior technical leader and have an opportunity to work with highly competent colleagues on challenging engineering problems and have a great impact on the organization. The role will offer you an opportunity to be able to dive deep into architectural topics and really help shape our future.\nAbove all, we are looking for people who will make HelloFresh better. We believe there are many different ways of developing skills and we love diverse experiences! So even if you don’t “tick all the boxes” but think you’d thrive in this role, we would really like to learn more about you.\nWhat you’ll do\nBe able to take responsibility for end-to-end software design and development processes, across the entire tech organization when needed.\nCooperate with other senior engineers to promote best practices in software architecture, design, development, delivery and deployment, and operations (DevOps Practices, Pair Programming, TDD, streaming, pub/sub, etc.)\nLead teams in ensuring we are adopting and using effectively state-of-the-art technologies.\nBe actively involved in large, strategic tech initiatives, such as distributed data mesh, streaming data, microservice architectures, code refactoring best practices, API definition, CI/CD implementation and more.\nCollaborate closely with our leadership in Tech, Product, Data and Business to improve our process, methodologies, communication flows, etc.\nBe an ambassador for HelloTech brand and partners in hiring to our Talent Acquisition Team.\nWhat you’ll bring\nStrong engineering and architecture experience and extensive knowledge in APIs and Microservices.\nSolid programming and architectural skills in one or more of our core languages: Golang, Kotlin or Python.\nProfessional knowledge and experience of commonly used technologies: Kafka, AWS, Kubernetes, SQL as well as best practices.\nAn ability to act as an advocate for best tech practices, such as CI/CD, TDD, BDD, DDD, Design Patterns.\nExperience in improving the environment in which you are working, for technology, methodology, and team collaboration.\nThe ability to mentor other developers and host knowledge sharing sessions.\nAn agile mindset with the ability to advocate for cross-functional collaboration.\nWhat we offer\nComprehensive relocation assistance to move to Berlin plus visa application support\nHealthy discount on weekly HelloFresh boxes\nAnnual learning and development budget to attend conferences or purchase educational resources plus access to the HelloFresh Academy\nSubsidised childcare with a professional nannying agency\nFree access to Headspace, biweekly in-house yoga classes (remote since March 2020)\nA diverse and vibrant international environment of 70+ different nationalities\nAdditional perks include: Free crash course in German, compensation for advanced external German classes, discounts for our neighbouring gym & Urban Sports Club, summer & winter parties, discount on our HelloFresh GO vending machines\nThe chance to have a significant impact on one of the fastest-growing technology companies in Europe in an exciting growth phase\n\nAbout HelloFresh\n\nWe believe that sharing a meal brings people of all identities, backgrounds, and cultures together. We are committed to celebrating all dimensions of diversity in the workplace equally and ensuring that everyone feels a sense of inclusion and belonging. We also aim to extend this commitment to the partners we work with and the communities we serve. We are constantly listening, learning, and evolving to deliver on these principles. We are proud of our collaborative culture. Our diverse employee population enables us to connect with our customers and turn their feedback into meaningful action - from developing new recipes to constantly improving our process of getting dinner to our customers’ homes. Our culture attracts top talent with shared values and forms the foundation for a great place to work!\nAt HelloFresh, we embrace diversity and inclusion. We are an equal opportunity employer and do not discriminate on the basis of an individual's race, national origin, color, gender, gender identity, gender expression, sexual orientation, religion, age, disability, marital status or any other protected characteristic under applicable law, whether actual or perceived. As part of the Company’s commitment to equal employment opportunity, we provide reasonable accommodations, up to the point of undue hardship, to candidates at any stage, including to individuals with disabilities.\n\t\t\t\t",
            "postedDate": "March 01, 2022",
            "compName": "Hellofresh"
        },
        {
            "title": "Software Engineer",
            "location": "Girraween, NSW, Australia",
            "description": "\n\t\t\t\t\tChirpn is looking for a Software Engineer who will:\nCoach and mentor other team members Contribute to the technical quality of the team through education and best practices.\nProvide leadership and drive innovation based on customer and team feedback.\nWork with stakeholders to gather requirements and develop technical solutions.\nAssist Sales/SSM/PM in scoping and defining project scopes of work.\nDevelop strong relationships across both customer and AppDynamics businesses.\nUnderstanding client requirements and documenting Service Requirement Specifications (SRS).\nCoordinating with the development team regarding the approved SRS and getting the client requirements converted into reality.\nAnalysis of the developed e-forms and websites by performing test cases and test plans on them.\nKeep abreast of dynamic technology landscapes through ongoing training and enablement.\nMaintain expert level AppDynamics implementation proficiency. Enable customers to realise the value from their AppDynamics investments.\nResponsible for preparing Technical Planning and As built document of applications.\nBe responsible for the overall quality and timeliness of the deliverable.\nRequired Experiences:\nBachelor’s degree in computer science or equivalent\nTechnical experience 5+ years of relevant technical experience as a Senior Consultant\nExcellent customer interaction, communication, and presentation skills\nStrong and deep technical understanding of Scripting capabilities in SPLUNK for monitoring\nProficient in creating custom alert, report, dashboard creation in appD,Splunk,Dynatrace.\nExperience/strong knowledge with Artifact repositories, such as monitoring tools - Splunk\nProven ability to educate and influence customers Knowledge and hands-on experience (2+ years) in at least two of the following technical domains: SDLC practices including Agile, DevOps and CI/CD strategies, IT Operations (NOC or similar) Virtualization and Containerization Cloud technologies (AWS, Azure, GCP, etc), Application Performance Management Application\nDevelopment Operating systems Databases Servers and networks Experience with JavaScript (JQuery, Dojo, AngularJS, etc) Java (J2EE) .Net ITIL, TOGAF certifications a plus\nSolid command of the English language (written and spoken) with any additional language(s) a plus Ability to travel.\nPosition Type : Full -Time\nSalary Range (per Year) : $130,000 - 140,000 + Super\nemail:\n\nFull time\n\t\t\t\t",
            "postedDate": "March 10, 2022",
            "compName": "Chirpn IT Solutions"
        },
        {
            "title": "Senior Software Engineer FBS",
            "location": "Ganjingzi District, Liaoning, 116039, China",
            "description": "\n\t\t\t\t\tAbout the opportunity\nAbout FBS – Fidelity (Dalian) Business Service\n\nFidelity (Dalian) Business Services Co., Ltd. (FBS) was established in August 2011, is supporting Fidelity Investments in the US. With over 500 people in Dalian, FBS focuses on technology development and innovation, while partner with our colleagues in Ireland, India and the US to delivery digitized customer experiences and emerging technologies for Fidelity’s business partners.\n\nYour Key Accountabilities\n\nAssume complete execution responsibility of small size project independently\nUnderstand business requirements through direct interaction and define the scope of work\nDesign and development of the Front-End web applications\nEnsure that work performed within the group is supportable and completed within the overall IT strategy of Fidelity\nEnsure that work is completed to a sufficient level of quality\nEnsure adherence to change management processes and assist in facilitating the ongoing review and enhancement of these processes.\nWorks under minimal supervision to meet goals set by management\nMaintain Quality documents and follow the process defined for development\n\nYour Skills and Experience\n\nEssential skills\nProficient in use of Angular.JS, HTML, JavaScript, CSS.\nSkilled in use of Typescript.\nSkilled in use of Nodejs include derivative framework( Express/KOA ).\nSkilled in use of at least three JavaScript MV* frameworks (Angular.js/Vuejs/React)\nProficient in least one JavaScript MV* framework and analysis of source code or core implementation\nHave a certain understanding of modularity or componentization\nAbility to write high availability, highly compatible code\nExperience in project construction and have certain project architecture capabilities\nAbility to communicate effectively in English language (both written and verbal)\n\nDesirable skills\nExperience with Web Services\nExperience with Spring framework\nExperience with Node.js\nExperience with project optimization\nExperience & good understanding of full development life cycle\nExperience in the use of a source control management system like Git.\n\nKey Facts in this Position\n\nJavaScript – 72 months\nAngular.js – 72 months\nNode.js – 48 months\nCommunication with English Language (both written and verbal) – 24 months\nAgile thinking – 18 months\n\nAbout you\n\nAbout Fidelity International\nFidelity International offers investment solutions and services and retirement expertise to more than 2.56 million customers globally. As a privately-held, purpose-driven company with a 50-year heritage, we think generationally and invest for the long term. Operating in more than 25 locations and with $783.6 billion in total assets, our clients range from central banks, sovereign wealth funds, large corporates, financial institutions, insurers and wealth managers, to private individuals.\n\nOur Workplace & Personal Financial Health business provides individuals, advisers and employers with access to world-class investment choices, third-party solutions, administration services and pension guidance. Together with our Investment Solutions & Services business, we invest $567 billion on behalf of our clients. By combining our asset management expertise with our solutions for workplace and personal investing, we work together to build better financial futures.\n\nOur clients come from all walks of life and so do we. We are proud of our inclusive culture and encourage applications from the widest mix of talent, whatever your age, gender, ethnicity, sexual orientation, gender identity, social background and more. We are a disability-friendly company and would welcome a conversation with you if you feel you might benefit from any reasonable adjustments to perform to the best of your ability during the recruitment process and beyond.\n\nWe are committed to being a truly flexible employer, encouraging and trusting our people to perform their role in the way that works best for them, our business, our colleagues and our clients. We offer the maximum possible flexibility over where and when you work for all, considering your role and any local regulations. We call this new approach \"dynamic working\".\n\nFind out more about what we do, our history, our new approach of \"dynamic working\" and how you could be a part of our future at\n\nApplying to this Job Role: Please note you are only required to upload your CV/Resume to the application screen.\n\nFull time\n\nJ30341\n\t\t\t\t",
            "postedDate": "March 03, 2022",
            "compName": "Fidelity International"
        },
        {
            "title": "Software Engineer",
            "location": "Prahran, VIC, Australia",
            "description": "\n\t\t\t\t\tWe are a leading Australian Telecommunications and Infrastructure services provider, specializing in wireless telecommunications, tower construction, engineering designs and networks. Our trusted clients are government agencies such as NSW Telco Authority and globally renowned companies such as Telstra, Optus, Tesla, AGL, Downer etc. Head quartered in Prahran Victoria, our team comprises - Engineers, Technologists, Technicians and Contract/Project Administrators and Surveyors.\nWe are growing rapidly and looking for an experienced Software Engineer who will assist us expanding our telecommunication network projects Australia wide.\nDuties/Responsibilities:\nEngage in the full Software Development Life Cycle - Technical Design, Development, Testing, Implementation and ongoing technical support.\nWorking in collaboration with Telcom engineering team to develop integrated solutions.\nCommissioning of software development across a range of platforms.\nCreating Mobile App to integrate with SharePoint portal allowing to capture the daily updates across Australia.\nDefine and ensuring adherence to best practices for software development (e.g. version control, issue tracking, code reviews, change management, testing).\nResolution of technical issues in coordination with project team.\nCentralized project management to improve on-site health and safety of the field staff by developing and maintaining systems that monitor and review the field staff from a centralized location.\nDesigning software allowing field engineers to capture project details.\nEnsures feasibility, functionality and integration with existing systems/platforms.\nDevelop software documentation allowing to capture completion documents from the field directly into the SharePoint portal.\nMaintenance of SharePoint portals and Mobile Apps to keep up-to-date and upgrade as required.\nProvide regular reports to management regarding project status and timelines.\nResponsible for compliance with all legislative/technical requirements including but not limited to Trade Practices, WHS, Environment & Energy, Regulatory Bodies etc.\nManage internal and external resources to achieve goals.\nManage changes to scope, schedule and budget.\nMeasure performance and provide regular reporting to stakeholders.\nKey Competencies:\nB.Sc./B.E. Computer Science, Software engineering or similar.\nMinimum 3 years’ experience in a software engineering or similar role(s).\nHands-on experience in software architectures, database designs and CI/CD.\nExperience in MS SQL server, MySQL, Cloud services, MS Project.\nKnowledge of scripting languages such as Python, JavaScript.\nProficiency in UI/UX of web and mobile applications.\nFamiliar with networking and communication protocols (e.g. Bluetooth, Wi-Fi).\nAbility to work independently throughout the various phases of the projects.\nExperience managing real time application behaviour.\nPerks and Benefits:\nSalary Range: $70,000 - $90,000\nCareer progression opportunities\nHighly competitive Salary\nFlexible working arrangement within warm friendly team\nTechnically challenging environment\nState-of-the-art engineering development facility\nBonus structure\nTraining, learning and development.\nApply:\nIf the opportunity resonates with you, please do not hesitate to “Apply” with a cover letter.\nContact:\nTracey Connerty\n\nFull time\n\t\t\t\t",
            "postedDate": "March 08, 2022",
            "compName": "EXCEL CONNECTIONS PTY LTD"
        },
        {
            "title": "IT Cloud DevOps Engineer",
            "location": "Altstetten, Zurich, 8048, Switzerland",
            "description": "\n\t\t\t\t\tRequisition Number\n247653BR\n\nYour role\n\nDo you have a knack for building innovative solutions? Are you experienced in an Investment Banking environment? We’re looking for someone like that who can help us:\n\nEngage Business & IT Stakeholders and partners to co-author and co-create solutions and contribute to define priorities\n\nAdhere to Enterprise Application design standards as well as SDLC guidelines and policies (Agile/Iterative/Waterfall)\n\nSuggest and implement controls to improve efficiency and effectiveness of the systems, processes, team structures.\n\nEngage SW vendors and develop strong working relationship\n\nConnect with the Global IT team to explore and develop synergies, cross-leverage opportunities to meet our business needs in the most cost effective but sustainable way.\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou’ll be working in the GCRG IT team based in Switzerland facing key stakeholders. Our role is to design and implement innovated IT solutions to meet UBS' regulatory commitments. You will be part of a global team that is responsible for delivering Compliance MS&C IT program - supporting the surveillance of bank-wide trading activity.\n\nYour expertise\n• experience with cloud environment design and deployment (preferred Azure)\n\n• experience with building and deploying Infrastructure-As-Code pipelines (preferred Terraform, ARM templates)\n\n• containerization in particular building Docker images\n\n• using version control software (preferred Gitlab)\n\n• good knowledge of CI/CD tools such as TeamCity and Azure DevOps and the ability to build and improve CI/CD pipelines for product teams\n\n• scripting experience in Unix\n\n• programming experience (Java/Python preferred)\n\n• basic knowledge of databases (PostgreSQL preferred)\n\nNice to have:\n\n• Kubernetes experience (preferred AKS)\n\n• automation experience using tools such as Ansible, Puppet\n\n• building solution designs to meet client and security requirements\n\n• knowledge of best practices for the design of high-availability, disaster recovery and integration with other applications solutions\n\n• elastic search knowledge\n\nYou are:\n\n• well versed with software development life cycle, configuration management, source code management, software release processes and ITIL framework\n\n• adaptable, able to work across diverse teams and functions across multiple cultures\n\n• able to demonstrate facilitative approach to issue resolution and show willingness to cross role boundaries to achieve desired outcomes\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Software Engineer",
            "location": "Ottawa, ON, Canada",
            "description": "\n\t\t\t\t\tJob ID: 135949\nRequired Travel :Minimal\nManagerial - No\nLocation: :Canada- Ottawa (Amdocs Site)\n\nWho are we?\n\nIf you’re a smartphone user then you are part of an ever more connected and digital world. At Amdocs, we are leading the digital revolution into the future. From virtualized telecommunications networks, Big Data and Internet of Things to mobile financial services, billing and operational support systems, we are continually evolving our business to help you become more connected. We make sure that when you watch a video on YouTube, message friends on Snapchat or send your images on Instagram, you get great service anytime, anywhere, and on any device. We are at the heart of the telecommunications industry working with giants such as AT&T, Vodafone, Telstra and Telefonica, helping them create an amazing new world for you where technology is being used in amazing new ways every single day.\n\nIn one sentence\n\nResponsible for design, development, modification, debug and/or maintenance of software systems\n\nWhat will your job look like?\n\nDesigning and implementing features within an evolving large scale, distributed microservice architecture.\n• Writing high-level and detailed design documents\n• Debugging, analyzing, and troubleshooting application code\n• Reviewing designs and code written by other members of the team\n• Collaborating with internal and external development partners\n• Helping to shape and influence our next generation architecture\n\nAll you need is...\n\n4+ years of experience in Java (or other object oriented programming language)\n• 7+ years of software development experience\n• Experience with design and implementation of complex software features\n• Experience with RESTful APIs (REST, JSON)\n• Experience with ANT, Maven, Jenkins\nExperience with TDD (test driven design) and/or junit framework or similar\n• Knowledge of design patterns\n• Experience using Agile methodologies\n• Excellent technical writing and communication skills\n• BScH Computer Science, Computer or Electrical Engineering, Mathematics or equivalent\nAll Amdocs roles require strong verbal and written communication skills, position-appropriate mentoring/leadership abilities, and ability to quickly master new systems and/or processes, the capacity to stay organized while managing competing priorities, and a deep customer service orientation, both internally and externally.\n\nNice to have skills\nExperience with Helm, Kubernetes, Docker\n• Knowledge of Network Functions Virtualization (NFV) infrastructure\n• Knowledge in the networking domain, the OSS domain or the BSS domain\n• Experience with Cloud (AWS, Azure)\n• Experience with database technologies (Cassandra, ElasticSearch, Graph Databases, NoSQL)\n\nWhy you will love this job:\n\n• You will be challenged to design and develop new software applications.\n• You will have the opportunity to work in a growing organization, with ever growing opportunities for personal growth.\n\nAmdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce\n\t\t\t\t",
            "postedDate": "March 04, 2022",
            "compName": "Amdocs"
        },
        {
            "title": "Software Engineer",
            "location": "Vasanth Nagar, Karnataka, India",
            "description": "\n\t\t\t\t\tWe at Yara are part of a global network, collaborating to profitably and responsibly solve some of the world's key challenges - resource scarcity, food insecurity and environmental change.\n\nAbout the Unit\n\nAbout Digital Ag Solutions\nYara aims to be the crop nutrition company for the future and is leading the development of sustainable agriculture and digital tools to contribute to solving global agricultural challenges. We have a worldwide presence with sales teams in ~150 countries and around 17,000 employees.\nDrawing on over a century of crop nutrition experience, Yara established the Digital Farming unit – now Digital Ag Solutions (DAS) – 4 years ago to explore how technology could be used to impact farmer livelihoods and productivity. Today, DAS has built products for smallholder and professional farmers, retailers and other farming ecosystem stakeholders across Asia, Africa, the Americas and Europe.\nWe are an international team of engineers, scientists, researchers, designers and agronomists working together to achieve Yara’s goal to responsibly feed this world and protect the planet. Join us in building new digital products and services to create value for stakeholders across the agricultural ecosystem.\n\nResponsibilities\n\nWork within a product team with a product manager, designers, and other developers to create engaging, user-centric solutions, applications and/or services that solve the needs of the smallholder farming communities around the world (farmers, offtakers, retailers, dealers, markets, and all other stakeholders within a farming community).\nParticipate in the full lifecycle of a product, from early stage inception through to full market release and continuous improvement after initial launch\nWork together with field solutions team of UX professionals and Subject Matter Experts in rapidly creating solution prototypes to validate ideas collated from smallholder community personas across the globe.\nContribute to MVPs, partial and full release products and various stages of development and release on different release trains.\n\nProfile\n\nBuilt at least two web or mobile applications with ReactNative.\n\n4+ years experience building backend services and Front End apps for at least two web or mobile applications using Nodejs/Javasript/Express/NestJs.\n2+ years experience with GraphQL, Typescript and other modern tools\nAt least two recent projects involving databases (postgres/ rds aws)\nComfortable working with our tools: AWS, RDS, GitHub, Jira, circleCi, Docker, Kubernetes.\nEligible for appropriate grades of seniority based on background experience and competence levels.\nAligned with our principles: agile, customer-centric, scrum, service-oriented architecture, self-organization, transparency and sustainability.\nExcellent written and oral communication in English.\nPassionate for sustainability, agriculture and/or coffee.\n\nAdditional Information\n\nWorking at Yara Digital Ag Solutions\nWe are dedicated to empowering individuals from all backgrounds and value each person’s unique perspectives. We strive to create an inclusive work environment reflecting the diversity in society. We encourage employees to prioritise physical and mental wellbeing, continuous learning and personal growth. We pay competitive mid-market remuneration and benefits in each of the countries we operate in.\n\nContact details\n\nApply no later than\n\nKnowledge grows through differences\nYara is committed to creating a diverse and inclusive environment and is proud to be an equal opportunity employer. We believe that creating a diverse and inclusive work environment is not only the right thing, but also the smart thing to do. To deliver on this, Yara has firmly anchored Diversity & Inclusion (D&I) in our business strategy and has more than 400 employees worldwide involved in D&I ambassador networks.\n\t\t\t\t",
            "postedDate": "February 17, 2022",
            "compName": "Yara"
        },
        {
            "title": "Java and Azure Tech Engineer",
            "location": "London, Greater London, United Kingdom",
            "description": "\n\t\t\t\t\tRequisition Number\n248148BR\n\nYour role\n\nWe’re looking for a Securities Funding and Optimization developer to:\n\n• Help build out the securities funding and optimization cloud native platform\n• Participate and collaborate in dedicated cross functional and independent team of technologists to build out enterprise wide solutions\n• Work with product owner and your team to understand, own and drive business products as well as client solutions\n• Aim for reduction of time to market through technology and agile innovation\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour Career Comeback\nWe are open to applications from career returners. Find out more about our program on ubs.com/careercomeback.\n\nYour team\nYou'll be working in the GM Financing Stream, Securities Funding and Optimization Crew, supporting our newly created chapters to embed the unified model of Agile@UBS and take our platform to the cloud. We are a team of dedicated professionals, who are looking to build out our next generation cloud only based platform to solve complex enterprise wide problems.\n\nYour expertise\n• a strong sense of continuous improvement to continually be growing once’s own craft, learning new tools and sharing techniques across community.\n\n• ability to communicate effectively well within team, across teams and in larger community of practice, as well as facilitate agile ceremonies.\n\n• deep understanding of the software development craft, with focus on prem and cloud based (Azure), event driven solutions and architectures.\n\n• experience delivering solutions using kafka, data bricks, Kubernetes, containers, GitLab and CI/CD pipelines\n\n• expert java core hands on technologist, with deep understanding of TDD\n\n• ability to analyse complex trading, order management and execution requirements, design and implement solutions\n\n• Successfully applied solutions to meet non-functional requirements such as stability, capacity, latency and throughput\n\n• A proven team player with strong leadership skills, who is able to work in a collaborative way across business units, teams and regions\n\n• hands-on experience of agile software development practices and methodologies, especially scrum\n• strong written and verbal communication skills in English and a desire to work as part of a global team\n\n*LI-GB\n*EFC-UBS\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        }
    ]
}
