{
    "datas": [
        {
            "title": "Software Engineer - Simulation",
            "location": "Chesterfield, MO",
            "description": "\n\t\t\t\t\tWe are looking to hire Software Engineers with two to ten+ years of experience to work in an agile environment and with applications that simulate aircraft systems, as part of development teams building training devices for military aircraft. Software Engineers build, enhance and optimize applications and programs for the on-going development of aircraft virtual training programs.\nThese positions require a DoD Clearance or the ability to obtain an Interim.\nThe positions are located on-site in St. Louis, MO or Jacksonville, Florida.\nExcellent pay and benefits including 401 company match, medical/vision/dental plans.12 paid holidays, 13 PTO days yearly.\n\nRESPONSIBILITIES:\n· Developing code to incorporate quality inputs in vehicle simulation trainer software Full Software Development Life Cycle (SDLC) environment (defining requirements, designing, implementing and testing the software)\n· SAFe Agile software development\nQUALIFICATIONS:\n· Bachelors of Science degree (computer science, software engineering, computer engineering, or related field)\n· Experience with technologies:\no C, C++, C#, Python, Java\no scripting languages\no GIT\no MS Visual Studio/Visual Studio Code\n· SAFe Agile software development methodology experience desired\n· Windows and Linux/Red Hat experience\n· Software verification experience (i.e. testing/debugging, writing verification cases and procedures, running verification procedures and investigating issues).\nFor more information please call me directly and/or send a resume with a good time to call you.\nJim Jennings - 636-484-6869 - \n\t\t\t\t",
            "postedDate": "February 13, 2022",
            "compName": "CompuScienceIT"
        },
        {
            "title": "Software Engineer Level 0",
            "location": "Fort Meade, MD",
            "description": "\n\t\t\t\t\tAre you ready for change or tired of the red tape? Do you want to work in a limitless environment where you matter, great work is recognized, and have opportunities for advancement? Davis Unlimited Information Technologies, Inc (DUIT) wants you! We have immediate openings for software engineer(s) Level 0. We are looking for the best and brightest software engineers to join our winning and innovative information technology team!\nThe Software Engineer Level 0 develops, maintains, and enhances complex and diverse software systems (e.g., processing-intensive analytics, novel algorithm development, manipulation of extremely large data sets, real-time systems, and business management information systems) based upon documented requirements. Works individually or as part of a team. Reviews and tests software components for adherence to the design requirements and documents test results. Resolves software problem reports. Utilizes software development and software design methodologies appropriate to the development environment. Provides specific input to the software components of system design to include hardware/software trade-offs, software reuse, use of Commercial Off-the-shelf (COTS)/Government Off-the-shelf (GOTS) in place of new development, and requirements analysis and synthesis from system level to individual software components.\n\nAll Applicants must have the following: an active high-level security clearance that required an investigative screening poly exam and meet the job requirements specified for applying position. Currently, we are not seeking clearable applicants. All information provided is subject to verification. A security background check is required, and if you have already completed a background check/clearance, then that is a plus!\nWhy wait? Apply, and submit your resume today!\nQualifications:\n\n· Seven (7) years of experience as a SWE, in programs and contracts of similar scope, type, and complexity is required.\n· A Bachelor’s Degree from an accredited college or university in Computer Science or related discipline. An additional four (4) years of SWE experience on projects with similar software processes may be substituted for a bachelor’s degree.\n· Experience working with the customer or stakeholder to define, document, and implement system requirements.\n· The ability to create and execute test cases for peer code testing.\n\nShall possess the following capabilities:\n\n· Analyze user requirements to derive software design and performance requirements.\n· Debug existing software and correct defects.\n· Provide recommendations for improving documentation and software development process standards.\n· Design and code new software or modify existing software to add new features.\n· Integrate existing software into new or modified systems or operating environments.\n· Develop simple data queries for existing or proposed databases or data repositories.\n· Develop or implement algorithms to meet or exceed system performance and functional standards.\n· Assist with developing and executing test procedures for software components.\n· Write or review software and system documentation.\n· Develop software solutions by analyzing system performance standards, confer with users or system engineers; analyze systems flow, data usage and work processes; and investigate problem areas.\n· Serve as team lead at the level appropriate to the software development process being used on any particular project.\n· Modify existing software to correct errors, to adapt to new hardware, or to improve its performance.\n· Design, develop and modify software systems, using scientific analysis and mathematical models to predict and measure outcome and consequences of design.\n· Design or implement complex database or data repository interfaces/queries\n\nExperience with the following technologies is required or desired:\n\n· Windows OS, Required (2 years)\n· SQL, Required (2 years)\n· Unix/Linux OS, Required (2 years)\n· JAVA or C++, Required (2 years)\n· Groovy on Grails or Similar Technologies, Required (6 months)\n· DoJo Service or Similar Technologies, Required (6 months)\n· HTML, (2 years)\n· CSS, Desired\n· JSP, Desired\n· JavaScript, Required (2 years)\n· AJAX, Desired\n· Spring framework, Desired\n· JEE technologies, Desired\n· Developing Web Services (SOAP and REST), Required (6 months)\n· XML tools (e.g., XPATH, XQUERY, DOM, SAX, XSLT), Desired\n· IIS, Desired\n· APACHE, Desired\n· CASPORT, Desired\n· Public Key Infrastructure (PKI), Required (6 months)\n\t\t\t\t",
            "postedDate": "March 01, 2022",
            "compName": "DUIT"
        },
        {
            "title": "Software Engineer 3 Cloud Analytics",
            "location": "Columbia, MD",
            "description": "\n\t\t\t\t\t10,000 Sign on Bonus for hired candidates who have all skills, clearances, and qualifications Have some qualifications, but not all? Talk tech to us, let's find a solution!\n\nAre you ready for change or tired of the red tape? Do you want to work in a limitless environment where you matter, great work is recognized, and have opportunities for advancement? Davis Unlimited Information Technologies, Inc (DUIT) wants you! We have immediate openings for the best and brightest software engineer(s) with 20 or more years of experience to join our winning and innovative information technology team!\n\nThis position requires a candidate to design, develop, maintain, enhance, and document software systems. Candidate must be able to work independently and/or in a lead technical role, developing system architecture and requirements, defining processes and methodologies, resolving complex technical issues or research problems, and may have responsibility for directing the software activities of a large program.\n\nSecurity Clearance Requirements:\nThis position requires all candidates to be U.S. Citizens and possess an active TS/SCI Security Clearance with Polygraph\n\nResponsibilities:\nDevelops processes to normalize and combine necessary data.\nMines/Analyzes source and pre-processed data.\nProvides software and systems engineering support to a system correlating data from various sources to generate metrics and visualization displays.\nMeets and works with Customers to integrate and enrich data from new sources/flows.\nTwenty (20) years’ experience as a SWE in programs and contracts of similar scope, type, and complexity is required.\nBachelor’s degree in Computer Science, Mathematics, Electrical Engineering, Systems Engineering, Cybersecurity, other Computer Science-related (Software Engineering, Information Systems, Information Technology, Computer Engineering, etc.) from an accredited college or university is required.\n\nEducation & Years of Experience:\no Four (4) years of additional software engineering experience on projects with similar software processes may be substituted for a Bachelor's degree\n\nRequired Skills:\nMust have experience and background in cloud and analytics technology.\nExtensive Linux experience\nWindows knowledge\nPIGLET knowledge\nSplunk (highly desired)\n\nMust have experience with the following:\no Hadoop / Accumulo\n\no JavaScript, Python, PowerShell\n\no C#, Java\n\no PIG\n\no MS SQL Server\n\no MySQL\n\no Windows, Linux\n\no Data Analytics\n\nMust be proactive and have the ability to independently learn.\nNiFi knowledge\nSecurity+, Network+, or A+\nDesired Skills\nNiFi knowledge\nRequired Certifications\nSecurity+, Network+, or A+\n\t\t\t\t",
            "postedDate": "March 01, 2022",
            "compName": "DUIT"
        },
        {
            "title": "Software Engineer 3 Tools and Support",
            "location": "Columbia, MD",
            "description": "\n\t\t\t\t\t10,000 Sign on Bonus for hired candidates who have all skills, clearances, and qualifications Have some qualifications, but not all? Talk tech to us, let's find a solution!\n\nAre you ready for change or tired of the red tape? Do you want to work in a limitless environment where you matter, great work is recognized, and have opportunities for advancement? Davis Unlimited Information Technologies, Inc (DUIT) wants you! We have immediate openings for the best and brightest software engineer(s) with 20 or more years of experience to join our winning and innovative information technology team!\n\nThis position requires a senior level software professional interested in supporting customers with code quality. The ideal candidate possess a wealth of software development expertise and desires to support enterprise customers by guiding and coaching on software development techniques. In addition, this candidate must be willing to support the maintenance and enhancement of tools in support of code quality.\n\nSecurity Clearance Requirements:\nThis position requires all candidates to be U.S. Citizens and possess an active TS/SCI Security Clearance with Polygraph\n\nEducation & Years of Experience:\n\nA minimum of (20) years of software development experience, AND\nA Bachelor's degree in Computer Science or related technical discipline from an accredited college or university\nFour (4) years of additional software engineering experience on projects with similar software processes may be substituted for a bachelors degree\n\nRequired Skills:\nMinimum 5 years AWS development including the security system and network system\nMinimum 3 years of Docker containerization skills\nMinimum of 3 years on at least 2 separate major programming languages (e.g., Java, C#, C++, Python, JavaScript/Typescript)\nMinimum of 2 years testing automation skills, dynamic and static (or related)\n\nRequired Certifications:\nSecurity+, Network+, or A+\n\t\t\t\t",
            "postedDate": "March 01, 2022",
            "compName": "DUIT"
        },
        {
            "title": "FX CashRisk - Software Engineer",
            "location": "Singapore, Central, Singapore",
            "description": "\n\t\t\t\t\tRequisition Number\n246643BR\n\nYour role\n\nAre you passionate about FX Trading Technology? Are you able to use your skills to build robust and scalable multi-server systems? We are looking for someone like that to:\n\n• work as part of a multi-cultural international team to further develop and deploy our FX Static Data System according to business plans and priorities\n• develop first class solutions for Regulatory and Business driven initiatives\n• contribute to the process of translating business and regulatory requirements into innovative solutions\n• work independently on even demanding projects\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou'll be working as a part of an international Foreign Exchange IT team, with team members in Poland, Singapore and Switzerland.\n\nWe develop IT solutions for FX Cash Trading and all its stakeholders that enables our business to grow and ensures it is remaining compliant with the international regulations. Our team focuses on creating sustainable IT solutions to meet the evolving requirements of the business, clients, and the marketplace. We work in close collaboration with the trading desks, the COO team, our control functions, and other IT teams.\n\nYour expertise\n• experience with messaging technologies (IBM MQ), Python or Perl scripting, CORBA middleware\n• experience in designing and implementing multi-threaded systems, development and implementation for low latency and complex real time systems\n• experience in software development in complex distributed real time systems\n• experience with C/C++ on UNIX/Linux\n• experience with shell scripting\n• experience with git and gitlab\n\n*#LI-SG\n\n*EFC-UBS\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\nEmployees working from UBS Singapore offices must comply with Workforce Vaccination Measures as implemented by the Singapore government with effect from 1 January 2022, and other applicable safe management measures as may be amended from time to time.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "z/OS Software Engineer",
            "location": "Zurich, 8037, Switzerland",
            "description": "\n\t\t\t\t\tRequisition Number\n235726BR\n\nYour role\n\nAre you passionate about z/OS Software Engineering? Do you want to help set the direction and strategy for the z/OS operating system? Are you motivated to work in a complex, diverse and global environment? We are looking for an Engineer to join our team and help us to:\n\n• evaluate, plan and integrate technical infrastructure solutions\n• guarantee a secure infrastructure environment as well as production stability and performance\n• analyze errors in systems and define corrective measures (you’ve got a good eye)\n• cooperate with other groups in engineering on delivery of large-scale programs\n• maintain & improve existing deployment and build mechanisms\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nInfrastructure Core is a global organization within Technology Services Infrastructure & Security Engineering, providing technology platforms to underpin our partners business applications. You will be part of the z/OS Systems Engineering team, which has a global footprint and works with other support organizations, Operations staff and wider team members spread across the world. Together we drive consistency across business divisions and optimize operations and support costs, by providing timely, robust, cost effective solutions and products to our clients.\n\nYou'll be working in the z/OS Software Services team based in Basel, Switzerland. As an IT System Engineer, you will be instrumental in setting the direction and strategy for the z/OS operating system across the globe and in designing and building solutions to automate the deployment, configuration and upgrade of these systems. You will be joining a well-established team who will provide invaluable guidance to help you grow your knowledge and career. Teamwork is pivotal to our success; it plays a very important role. We offer flexibility in the workplace and equal opportunities to all our team members.\n\nYour expertise\n• excellent knowledge of z/OS operating systems architecture, design and implementation\n• sound knowledge of SMP/E, software deployment processes, TSO/ISPF, Rexx, z/OS and it's subsystems\n• welcome would be skills in zLinux and Assembler programming, but not necessarily a must-have\n• preferably previous experience working in complex infrastructure projects\n• a committed and visionary team player with analytical and logical mind-set (you can solve problems like nobody’s business)\n• well organized with an innate sense of how to prioritize across a complex environment\n• a hands-on person with natural instincts to support our customers\n• curious, collaborative and constantly interested in learning new things\n• fluent in English and eager to work in an English-Speaking Global Team\n\n*LI-UBS\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nContact Details\nUBS International Recruiting\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Associate Director, IT Software Engineer",
            "location": "Weehawken, NJ",
            "description": "\n\t\t\t\t\tRequisition Number\n248981BR\n\nYour role\n\nUBS Business Solutions US LLC seeks an Associate Director, IT Software Engineer in Weehawken, New Jersey.\n\nWe are looking for someone to:\n• Translate business and IT requirements for new trading venues and datacenter upgrades into technical deliveries.\n• Coordinate the delivery of all Execution and Platform infrastructure components.\n• Oversee the deployment of server hardware.\n• Collaborate with other global IT teams to deliver and maintain the electronic trading infrastructure.\n• Identify bottlenecks on trading systems and tune the server for optimal performance for low latency.\n• Perform performance benchmarks for the trading system to evaluate hardware choices.\n• Fine tune third party stack for performance and low latency on trading systems.\n• Provide third level support to the production services team for investigating system issues and latencies.\n\nQualified Applicants apply through . Please reference 000325 NO CALLS PLEASE. EOE/M/F/D/V\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou'll be working on the Group Technology team located in Weehawken, NJ.\n\nDiversity helps us grow, together. That’s why we are committed to fostering and advancing diversity, equity, and inclusion. It strengthens our business and brings value to our clients.\n\nYour expertise\n• Bachelor’s degree or foreign equivalent in Engineering, Electrical Engineering, Computer Science, Information Technology or related field and seven (7) years of experience in the job offered or as a Systems Engineer, Technical Senior Manager, UNIX Specialist, UNIX Specialist, UNIX Engineer, Senior Customer Support Engineer, UNIX Administrator or related occupation.\n• Position requires experience with the following; managing multiple projects; Linux, Unix OS and server administration; writing scripts (Perl, Unix, Shell or SQL); Network (Switching and Routing); Firewall security; Load Balancing techniques; working with high-volume, low latency real-time messaging applied to electronic trading; server configuration automation; translating business needs into technology solutions; Java Stack messaging technologies, multi-threading and caching; tuning network/server infrastructure for electronic trading; dealing with large amounts of data in real-time applications with big-data technologies; low latency infrastructure cards (SolarFlare and Mellanox); and precision time protocol (PTP).\n\n*LI-DNI\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Senior Software Engineer Java",
            "location": "Pune, Maharashtra, India",
            "description": "\n\t\t\t\t\tRequisition Number\n247365BR\n\nYour role\n\nDo you want to play part in developing a state-of-the-art Front Office Risk System using Cloud Microsoft Azure technologies? Do you have the ability to resolve complex logical issues and think outside of the traditional development box? Do you want to work with a start-up mentality?\nWe are looking for a Java software engineer who can/wants to:\n• Engineer solutions for counterparty credit risk reusing Computation and Data services\n• Create cohesive technology solutions using microservices\n• Take a hands on approach to investigating and solving problems\n• Focus on product quality (utilizing review, testing and fast feedback)\n• Analyze business needs working with business users to inform solution delivery\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou will be working in a hybrid pod comprising Global Treasury Technology, alongside Front Office Risk and P&L teams in Pune, and the Business. The team is highly motivated and consists of data quants and some of the bank's best technologists. This is a hands on technical role, where proven software design and development skills using core java logical approach to problem solving.\n\nYour expertise\nRequired Skills\no Hands on in Core Java which includes but not limited to multithreading, concurrency, memory management, collections\no Experience in Spring, Spring Batch/Boot\no Passionate about Design, Development and best coding practices. OOPS, Design Patterns.\no Good in problem solving, analysis skills (requirement refinement, abstraction), excellent communication skills\no Testing (Unit, System, Integration, UAT, Performance, Stability)\no Test Driven Development / Business Driven Development\no Iterative SDLC (Scrum ideal)\no Experience of large-scale enterprise software\no Results focused with desire to work closely with business partners, as part of a global team\n\nDesirable Skills\no Cloud Experience (AZURE preferred), Kubernetes, Microservices\no Robotic / Cucumber & Gherkin\no Terraform\no One of Big Data, Spark, Scala\no Knowledge of derivatives (FX, Rates, Credit, Commodities, Equities)\no Knowledge of risk\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nContact Details\nUBS Recruiting India\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Software Engineer - Java API Microservices",
            "location": "Krakow, Lesser Poland Voivodeship, Poland",
            "description": "\n\t\t\t\t\tRequisition Number\n242199BR\n\nYour role\n\nDo you want to play a key role in our cloud migration journey? Are you confident managing evolving user requirements? Do you want to design and build best-in-class, scalable applications using the latest technologies?\n\nWe’re looking for an Java Software Engineer to:\n•work in a dynamic, fast-paced environment that provides exposure to reference data and cloud technologies\n• understand business requirement and help define high level design and testing strategies.\n•collaborate to refine user requirements though test-driven development (TDD)\n•communicate effectively with the larger global team and take full ownership of assigned tasks\n•demonstrate strong problem-solving skills and share new concepts\n•perform code reviews and proactively share constructive feedback within the team\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou’ll be working in the Distribution – Data Services Transformation team in Krakow, Poland. We are a dynamic, global team that enjoys working together and we work closely with our clients to understand their requirement and solve their problem. Together as a team, we provide strategic and optimize solution to provision reference data to our users in line with the established Corporate IT Standards. As an API developer, you'll play an important role in migration and adoption of a diverse set of users as part of our cloud migration strategy.\n\nDiversity helps us grow, together. That’s why we are committed to fostering and advancing diversity, equity, and inclusion. It strengthens our business and brings value to our clients.\n\nYour expertise\n•ideally 5+ years of experience as an API Developer with strong programming knowledge in Java (v. 8+)\n•working experience in building REST API and event driven microservices\n•experience in distributed systems and Cloud environment for e.g., Azure (preferred), AWS, GCP\n\nIdeally to have\n•in-depth knowledge of relational and noSQL databases, experience in Cosmos DB is preferred.\n• expert in Spring (Boot, Cloud, Security, Azure), TDD (JUnit, Mockito), BDD (Cucumber, JBehave, Concordion, KarateJS)\n•knowledge of JSR-339 (JAX-RS), JSR-303 (Bean Validation Framework), Swagger or Open API specification, GraphQL is added plus\n•proficient at working with large and complex code bases (GitHub, Gitflow, Fork/Pull Model)\n•experience with continuous delivery and deployment pipelines (Teamcity, Jenkins, Docker, Kubernetes, Helm Charts) and Agile methodologies (SCRUM, XP, Kanban)\n\n*LI-UBS\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nContact Details\nUBS Recruiting Poland\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Software Test Engineer (F/M/D) Hamburg / Germany",
            "location": "Bahrenfeld, 22525, Germany",
            "description": "\n\t\t\t\t\tJob description\n\nOur customer has been the driver of innovations in the field of “secure data” for over 250 years and develops products and solutions for secure identities, secure data and secure infrastructures. The group of companies currently employs a total of more than 3,000 people\n\nSecure identities, secure data and infrastructures are our core competencies for a responsible design of digital change.\n\nWhat do we need for this?\n\nGreat people full of ideas and energy who do their best every day. What you can expect: a wide range of activities and countless opportunities for further development.\n\nShape the digital future with us! We are looking for personalities with team spirit who share our passion for protecting identities and data, think ahead and want to work with us on secure digitization solutions.\n\nTasks\n\nParticipation in the agile DevOps team and ensuring early feedback on the developed functions through consistent automation of tests\nRealization, implementation and documentation of automatic and manual component, integration, system and acceptance tests based on the requirements\nExamination of requirements for their testability, creation of test cases from identified test objects and the development of test scenarios\nSupporting the DevOps team with error analysis (third-level support)\nActive participation in the further development and optimization of the development and test processes\nParticipation in the integration of components to be tested in the test environment\n\nEssential qualifications\n\nSuccessfully completed studies in computer science or a comparable subject, alternatively relevant professional experience in testing software systems\nSound knowledge of web applications and web services, confident handling of relevant test tools such as Selenium,\nProtractor, JMeter and SOAP as well as routine use of methods for test case creation, execution and documentation\nExperience in the integration of Java-based web applications with and without an application server and in dealing with relational databases, CI/CD systems and automatic test systems\nKnowledge of operating platforms such as OpenShift desirable\nCommunication skills paired with the ability to offer constructive criticism\nHigh reliability, independent work and methodical approach as well as fun working in an agile team\n\nDesired language skills\n\nGerman – (B2-C1)\nEnglish – (B2-C1)\n\nLocation:\nHamnurg – Germany\n\nWorking mode:\n\nHybrid\nCompensation & Benefits\n\nSalary range\n€50,000.00 – €70,000.00 annually\n\nHolidays\n30 days\n\nJob benefits\n\nFlexible working hours\nIn-house canteen\nEmployee discounts\nFlat hierarchy\nFitness and health programs\nMeal allowance\nFamily Friendly\nPension or retirement plans\nEducation and career development\nCompany phone\nPossible relocation package\n\t\t\t\t",
            "postedDate": "February 08, 2022",
            "compName": "LEXEM Consulting s.r.o."
        },
        {
            "title": "SR. Software Engineer (remote)",
            "location": "Denver, CO",
            "description": "\n\t\t\t\t\tOur client is seeking a Senior Software engineer with AREV and OpenInsight 10 programming experience to maintain and advance our current environment. As a Sr. Software engineer, you will be a core member of the data engineering team, building, managing, and monitoring metadata-driven, big data platforms, processing data extracts, and providing transformation products. You will work with a team of passionate, experienced, nimble, and goal-oriented engineers that are solving complex problems to help the company expand.\n\nAmong the responsibilities of the position are :\n\n• Stabilizing and transitioning the legacy Advanced Revelation (AREV) database platform and creating the first product baseline for release to the company's remote offices.\n\n• Working with a development team in customizing software to meet anticipated production requirements.\n\n• Managing DOS AREV, AREV32, AREV64, and OpenInsight (Windows) software programs for DOS/Windows multi-user data access to DebtMaster\n\n• Maintain interfaces with the unique systems, creating data transfer to other company's financial and human resources systems.\n\n• Working with NCB team members as we upgrade from AREV64 to OpenInsight 10.\n\t\t\t\t",
            "postedDate": "February 23, 2022",
            "compName": "Bridgecor"
        },
        {
            "title": "Sr. Network Engineer",
            "location": "St. Louis, MO",
            "description": "\n\t\t\t\t\tOur Client is a leading technology company serving St. Louis, MO for over 30 years. We are seeking a talented Tier 3 Network Engineer to join our network technologies in our St. Louis, MO location. The primary responsibility is to provide support and management of all toolsets within our “Tech Stack”. The right candidate will show a focus on customer service and customer care, and grow technically within a company that places technical service, customer-first interaction and delivery as its most critical success measure.\nEssential Job Functions/Skills:\n· Project management and project implementation experience\n· Excellent organizational skills and attention to details\n· Deliver solutions based on established practices and procedures\n· Able to work when required with minimal supervision, but willing to additionally work in and contribute to a collaborative team environment\n· Strong consulting skills and ability to develop and clearly present solutions\n· Triage, review, and troubleshoot issues with various IT tools RMM\n· Demonstrated practical knowledge and experience with Microsoft Servers & Desktops\n· Demonstrated practical knowledge in LAN/WAN technologies\n· Extensive experience with creating IT documentation\nTechnical Skills:\n\n· Remote Management Tool: Kaseya or similar\n· Scripting & Automation: Powershell, batch scripting or similar\n· Corporate Anti-Virus Software Management: Crowdstrike, SentinelOne or similar\n· Corporate Backup Management: Unitrends, Datto\n· Corporate Spyware Software Management: Malwarebytes or similar\n· Reporting: Brightgauge, Liongard, Backup Radar, Kaseya\n· Windows Patch Management: Automox, Kaseya\n· Spam Filtering: Barracuda, AppRiver or similar\n· Server Operating Systems: Windows Server 2012, 2016 and 2019\n· Directory Services: Active Directory, Group Policy Management\n· Core Network Services: DNS, DHCP, Remote Desktop Services\n· Networking Technologies: Cisco Meraki devices (firewall, switching, WAPs, etc.) or similar\n· Ticketing Workflow Administration: AutoTask or similar\n· Hypervisors: Hyper-V, VMWare\nEducation & Experience:\n· Bachelor or Associates degree in related field preferred\n· 5+ years network or systems administration experience\n· Previous work experience with a Managed Service Provider is a plus\nBenefits:\nInsurance: Health, vision, dental; PTO; 401k; paid holidays, weekly pay\n\t\t\t\t",
            "postedDate": "February 16, 2022",
            "compName": "CompuScienceIT"
        },
        {
            "title": "Systems Engineer",
            "location": "Fort Meade, MD",
            "description": "\n\t\t\t\t\tFull-time\n\nAre you tired of the red tape? Do you want to work in a limitless environment where you matter, great work is recognized, and have opportunities for advancement? Change is Now...Davis Unlimited Information Technologies, Inc (DUIT) wants you! We have immediate openings for Systems Engineers. We are looking for the best and brightest Systems Engineers with 7 or more years of experience to join our winning and innovative information technology team! We are currently hiring Systems Engineers including tier I, II, III professionals.\n\nA Systems Engineer at DUIT is responsible for analyzing user requirements, concept of operations documents, and high-level system architectures to develop system requirements specifications. Analyzes system requirements and leads design and development activities. Guides users in formulating requirements, advises alternative approaches, and conducts feasibility studies. Provides technical leadership for the integration of requirements, design, and technology. Incorporates new plans, designs, and systems into ongoing operations. Develops technical documentation. Develops system Architecture and system design documentation.\n\nWhy work for us?\n\no No red tape!\n\no Competitive salaries\n\no Great Health/Dental/Vision Benefits\n\no Excellent 401K plans\n\no Limitless environment where you matter\n\no Recognition of great work and other employee incentives\n\no Opportunities for advancement\n\nDavis Unlimited Information Technologies, Inc. (DUIT) is a woman owned, minority owned small business information technology consulting company. We have opportunities for advancement and our salaries and benefits are competitive. We are an equal opportunity employer; check us out on the web. You can follow us on LinkedIn, Twitter, and Facebook. We do things differently, contact us to find out how...Together, we can DUIT!\n\nWhy wait Apply today!\n\nAll Applicants must have the following: an active high-level security clearance that required an investigative screening exam and meet the minimum job requirements specified for applying position. For this position, we are not seeking clearable or eligible applicants. All information provided is subject to verification. A security background check is required, and if you have already completed a background check/clearance, then that is a plus!\n\nWhat You’ll Get to Do:\n\nManage system requirements and derived requirements to ensure the delivery of production systems that are compatible with the defined system architecture(s) – Department of Defense Architecture Framework (DoDAF), Service-oriented Architecture (SOA), etc.\n\nContribute to the development of sections of systems engineering documentation such as System Engineering Plans, Initial Capabilities Documents, Requirements specifications, and Interface Control Documents\n\nAssist with the development of system requirements, functional requirements, and allocation of the same to individual hardware, software, facility, and personnel components\n\nCoordinate the resolution of action items from Configuration Control Board (CCB) meetings, design reviews, program reviews, and test reviews that require cross-discipline coordination\n\nParticipate in an Integrated Product Team to design new capabilities based upon evaluation of all necessary development and operational considerations\n\nAllocate real-time process budgets and error budgets to systems and subsystem components\n\nGenerate alternative system concepts, physical architectures, and design solutions\n\nDefine the methods, processes, and evaluation criteria by which the systems, subsystems and work products are verified against their requirements in a written plan\n\nDevelop system design solution that satisfies the system requirements and fulfills the functional analysis\n\nQualifications You'll Bring:\n\no Tier I Systems Engineers require- Seven (7) years experience as a SE in programs and contracts of similar scope, type and complexity is required. Bachelor’s degree in System Engineering, Computer Science, Information Systems, Engineering Science, Engineering Management, or related discipline from an accredited college or university is required. Five (5) years of additional SE experience may be substituted for a bachelor’s degree.\n\no Tier II Systems Engineers require- Fourteen (14) years experience as a SE in programs and contracts of similar scope, type and complexity is required. Bachelor’s degree in System Engineering, Computer Science, Information Systems, Engineering Science, Engineering Management, or related discipline from an accredited college or university is required. Five (5) years of additional SE experience may be substituted for a bachelor’s degree.\n\no Tier III Systems Engineers require- Twenty (20) years experience as a SE in programs and contracts of similar scope, type and complexity is required. Demonstrated experience in planning and leading Systems Engineering efforts is required. Bachelor’s degree in System Engineering, Computer Science, Information Systems, Engineering Science, Engineering Management, or related discipline from an accredited college or university is required. Five (5) years of additional SE experience may be substituted for a bachelor’s degree.\n\t\t\t\t",
            "postedDate": "March 01, 2022",
            "compName": "DUIT"
        },
        {
            "title": "Firmware Engineer II",
            "location": "Thorofare, NJ",
            "description": "\n\t\t\t\t\tResponsibilities Include\n\nSpecifying, designing, implementing, releasing, testing and supporting embedded software products for R&D software development department.\nParticipating in embedded design projects from concept to production\nDeveloping utilities, using C/C++, in support of the embedded system development process.\nWriting and executing Engineering / System test plan-cases\n\nQualifications\n\nEducation\n\nBachelors of Science in Electrical Engineering or equivalent field\n\nExperience\n\n2 years experience as an embedded software engineer\n\nKnowledge, Skills & Abilities\n\nTwo (2) years’ experience with C/C++ and embedded real time C\nExperience with bare metal embedded programming Experience with 8 &16 bit Microcontrollers\nExperience developing boot code power on self-test\nKnowledge and experience with In-Circuit Emulators and Logic Analyzers, Schematic Understanding and working closely with Hardware team\nPlus to have Linux/Unix or comparable OS, RTOS experience on 32 bit processor\nExperience with product specifications, systems analysis, microprocessor based systems, and firmware design\nExperience with Microsoft Office applications\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "psoc"
        },
        {
            "title": "Senior Software Testing Engineer",
            "location": "Penha District, Sao Paulo, 03704, Brazil",
            "description": "\n\t\t\t\t\tSenior Test Engineer\n\nWhen your products transform the way we live and work, nothing can be left to chance. Our Test Engineering team takes charge of the testing, evaluation and validation of all our devices. We’re a team of expert engineers responsible for the development of all test cases and test tools to ensure the functionality and compatibility of our products. We’re involved in the whole testing process from preparing test and diagnostic programs to recommending changes in testing equipment procedures and designing new testing equipment.\n\nJoin us as a Senior Test Engineer on our Customer Data team in Brazil to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\nAs a Senior Test Engineer, you will develop and document test plans for newly developed or current hardware and solutions products. You will partner with a test team during test execution and report results to development engineers and leadership. You will also create test plans that include resource requirements based on inputs from Development and Marketing. Finally, you will work with external validation partners to develop comprehensive test plans and test coverage across multiple test organizations.\n\nYou will:\n• Define and implements new test methodologies to reduce test time and increase test coverage\n• Implement a continuous improvement process for test plans, test cases, and automation during and after test projects\n• Evaluate effectiveness of test plan and assess test methodologies to reduce test time and increase test coverage\n• Communicate and partner with test technicians in the execution of test plans\n• Manage use of automation and test tools and identify opportunities for process improvement where possible, and develop and execute test automation scripts\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n• Good understanding of testing concepts/process and hands-on manual testing experience on databases (SQL) and ETL technologies\n• Experience in API Automation any language. ( C# is added advantage ).\n• Familiar with Unit Test, Mock, Test Driven Development etc.\n• Experience in white box, API testing using test tools or test framework\n• Proficient in reading and understanding technical data sheets\n\nDesirable Requirements\n• Bachelor’s degree\n• Knowledge on .NET API\n\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nApplication closing date: 28 Mar 2022\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR166833\n\nRemote/Remotely/Tele/Telecommute/From home\n\t\t\t\t",
            "postedDate": "March 09, 2022",
            "compName": "Dell"
        },
        {
            "title": "Software Test Engineer",
            "location": "Domlur, Karnataka, India",
            "description": "\n\t\t\t\t\tJob Profile: Test Engineer\nWork Location: Bangalore\n\nWhen your products transform the way we live and work, nothing can be left to chance. Our Test Engineering team takes charge of the testing, evaluation and validation of all our devices. We’re a team of expert engineers responsible for the development of all test cases and test tools to ensure the functionality and compatibility of our products. We’re involved in the whole testing process from preparing test and diagnostic programs to recommending changes in testing equipment procedures and designing new testing equipment.\n\nJoin us as a Test Engineer on our Test Engineering team in Bangalore to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\nAs a Test Engineer, you will develop and document test plans for newly developed or current hardware and solutions products. You will partner with a test team during test execution and report results to development engineers and leadership. You will also create test plans that include resource requirements based on inputs from Development and Marketing. Finally, you will work with external validation partners to develop comprehensive test plans and test coverage across multiple test organizations.\nYou will:\n• Assist in collecting test requirements and creating basic test plans and test cases\n• Follow risk management plans and execute test automation scripts\n• Work on assigned test engineering tasks according to project plans including schedule, budget and component cost targets\n• Document text execution progress and issues\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n• 1 to 2 years of relevant experience\n• Basic understanding of hardware and software system architecture and interactions and apply it to resolve issues\n• Enthusiastic about learning new tools, languages and operating systems\n• Proficient in reading and understanding technical data sheets\n\nDesirable Requirements\n• Bachelor’s degree\n\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nApplication closing date: 30-March-2022\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR161735\n\t\t\t\t",
            "postedDate": "March 08, 2022",
            "compName": "Dell"
        },
        {
            "title": "Java Software Engineer in Test FX Trading (IB Technology)",
            "location": "Wroclaw, Lower Silesian Voivodeship, Poland",
            "description": "\n\t\t\t\t\tRequisition Number\n248203BR\n\nYour role\n\nDo you want to play a key role in building FX Trading Applications? Are you proud of delivering quality software to production? Do you like to be challenged and encouraged to learn and grow professionally?\n\nWe are looking for a Java Software Engineer in Test to:\n\n• create automated tests to sign off new functionality\n• take ownership of building, extending and maintaining the test automation suite\n• support the team to adhere to the highest testing standards\n• be involved in the entire software delivery lifecycle\n• support us with our Cloud journey\n\nFunction Category\nInformation Technology (IT)\n\nBusiness Divisions\nGroup Functions\n\nJob Type\nFull Time\n\nYour team\nYou will be working in the FX Orders team in Wroclaw, which is part of a global Investment Bank Technology organization. The team is working using agile principles and is responsible for building and maintaining Client Order Management Systems for FX Resting Orders, applications for FX Price Distribution, and much more. As a Test Automation Engineer, you will play in important role to deliver the best business outcomes by closely collaborating with business stakeholders, product managers and FX Front Office IT.\n\nDiversity helps us grow, together. That’s why we are committed to fostering and advancing diversity, equity, and inclusion. It strengthens our business and brings value to our clients.\n\nYour expertise\n• strong automation development experience with Java\n• good understanding of test automation concepts and patterns\n• confident to work on large projects in complex environments with fast paced deliveries\n• knowledge of test methodologies and the software development lifecycle\n• hands-on experience with Unix and Junit, other technologies are a plus: Spring, Spring Boot, Maven, Mockito, Gradle, Git, JMS, relational databases, Docker\n• FX domain knowledge and cloud technologies are a plus\n\nAbout us\nUBS is the world’s largest and only truly global wealth manager. We operate through four business divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management and the Investment Bank. Our global reach and the breadth of our expertise set us apart from our competitors.\n\nWith more than 70,000 employees, we have a presence in all major financial centers in more than 50 countries. Do you want to be one of us?\n\nJoin us\nAt UBS, we embrace flexible ways of working when the role permits. We offer different working arrangements like part-time, job-sharing and hybrid (office and home) working. Our purpose-led culture and global infrastructure help us connect, collaborate, and work together in agile ways to meet all our business needs.\n\nFrom gaining new experiences in different roles to acquiring fresh knowledge and skills, we know that great work is never done alone. We know that it's our people, with their unique backgrounds, skills, experience levels and interests, who drive our ongoing success. Together we’re more than ourselves. Ready to be part of #teamUBS and make an impact?\n\nContact Details\nUBS Recruiting Poland\n\nDisclaimer / Policy Statements\nUBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.\n\t\t\t\t",
            "postedDate": "March 02, 2022",
            "compName": "UBS"
        },
        {
            "title": "Systems Engineer- Aviation-Simulation",
            "location": "Chesterfield, MO",
            "description": "\n\t\t\t\t\tWe are looking to hire multiple Systems Engineers with two or more years of experience to work in a Scaled Agile Framework environment (SAFe) to support all development aspects of engineering solutions that simulate aircraft systems These Engineers will have 2 to 10+ years of experience and be a part of the development teams building training devices for military aircraft. These Systems Engineers will interact with customers, suppliers, program management, integration, and test engineers to help build, enhance, and optimize applications and programs for the ongoing development of aircraft virtual training programs.\nThese positions require a DoD Clearance or the ability to obtain an Interim.\nThe positions are located on-site in St. Louis, MO or Jacksonville, Florida.\nExcellent pay and benefits including 401 company match, medical/vision/dental plans.12 paid holidays, 13 PTO days yearly.\nQualifications include:\n· Ability to interpret and utilize mechanical drawings and electrical schematics to\nvalidate the installation of hardware and system interconnects.\n· Experience in supporting a product through an entire development cycle.\n· Experience with systems engineering tools such as IBM Rational DOORS (Dynamic Object\nOriented Requirements System.\n· Experience working within the Scaled Agile Framework (SAFe) or other Agile development environment.\n· Basic or intermediate experience in software languages (C., C#, C++, Python, Java)\n· Experience with Verification/Validation and Systems Integration\n· Experience with the flight or mission-critical systems and their capabilities typically\nfound in military aviation – including propulsion, navigation, sensor, and weapon suite.\n\nFor more information please call me directly and/or send a resume with a good time to call you.\nJim Jennings - 636-484-6869 - \n\t\t\t\t",
            "postedDate": "February 13, 2022",
            "compName": "CompuScienceIT"
        },
        {
            "title": "Cero Design Engineer Experience",
            "location": "Chennai, Tamil Nadu, India",
            "description": "\n\t\t\t\t\tBest Opportunity for Mechanical Design Engineer Experience\nImmediate joiner is preferred.\nTools: Cero Design Engineer\nExperienced with software Knowledge in Solid Work or other design software, Product design and development knowledge, innovative technical details for Mechanical engineers candidate prior Design knowledge is must.\nQualification: Diploma / BE / B Tech Mechanical Engineer\nExperience: Minimum 6 Month or 8 years’ Experience.\nSalary: As per the industry norms.\nFunctional Area: Production / Design Software Skills: Autocad / Solid Works / Creo Work Location: Chennai ( Sriperumbudur / Ambattur )\n\ncall 9176304925\n\t\t\t\t",
            "postedDate": "October 27, 2021",
            "compName": "Red Arrow Pvt ltd"
        },
        {
            "title": "Principal Software Engineer - IT",
            "location": "Austin, TX",
            "description": "\n\t\t\t\t\tIT Principal Software Engineer\n\nThe Software Engineering team delivers next-generation software application enhancements and new products for a changing world. Working at the cutting edge, we design and develop software for platforms, peripherals, applications and diagnostics — all with the most advanced technologies, tools, software engineering methodologies and the collaboration of internal and external partners.\n\nJoin us as a IT Principal Software Engineer on our Software Engineer - IT team in the United States (Remote) to do the best work of your career and make a profound social impact.\n\nWhat you’ll achieve\nAs an IT Principal Software Engineer, you will deliver products and improvements for a changing world. Working at the cutting edge, you will craft and develop software for platforms, peripherals, applications and diagnostics — all with the most sophisticated technologies, tools, software engineering methodologies and partnerships.\n\nYou will:\n• Develop technical solutions to meet business requirements.\n• Assist in training, work assignment and mentoring of less experienced developers.\n• Provide training and mentor other engineers when required.\n• Be a domain specialist in one or more technical programming specialties.\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:\n\nEssential Requirements\n• Ability to apply extensive knowledge of application programming and analysis.\n• Proven experience in software development methodologies.\n• Detailed understanding of key business processes.\n• Ability to communicate and translate needs to technical solutions.\n• Advanced knowledge of automated testing tools and procedures and experience with SQL and NoSQL Databases. MongoDB, Elastic, Solr are big plus.\n\nDesirable Requirements\n\n• 8+ years of validated experience with expertise in the following: Web AP( MS ASP.Net), C#, .Net Framwork, Web Services, WCF, JSON, SOAP, REST, JQuery, Knockout JS, Angular, and .NetCore.\n• Bachelor’s degree in computing engineering or computer science.\nHere’s our story; now tell us yours\n\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\n\nWhat’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\n\nWe started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.\n\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.\n\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Equal Employment Opportunity Policy here.\n\nFull time\n\nR164215\n\t\t\t\t",
            "postedDate": "March 09, 2022",
            "compName": "Dell"
        }
    ]
}
